{
  "backend/main.mo": "Minimal Motoko actor exposing a single `ping` query function that returns the string 'pong'.",
  "feature_evidence.json": "Feature evidence report confirming that the greeting text in HomePage.tsx was changed from 'Good morning 👋' to 'Hi Dev...💛' with high confidence.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing each file's role and notable implementation details.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom property tokens for light and dark themes, applied globally to base elements.",
  "frontend/index.html": "HTML entry point for the React app, setting up PWA meta tags, Google Fonts preloads, and mounting the root div with the main module script.",
  "frontend/public/manifest.json": "PWA web app manifest for MyOrganizer Pro, defining app name, icons, display mode, and theme colors.",
  "frontend/public/sw.js": "Service worker implementing a cache-first with network fallback strategy for static assets, with cache versioning and notification click handling.",
  "frontend/src/App.tsx": "Root app component managing tab-based navigation, lazy-loading Notes and Records pages, initializing settings and seeding the database on mount, and rendering the AppLayout with a ToastContainer.",
  "frontend/src/components/common/LoadingSpinner.tsx": "Provides a spinning `LoadingSpinner` component and a `PageSkeleton` placeholder used during lazy page loads.",
  "frontend/src/components/common/Modal.tsx": "Accessible modal dialog component with configurable size, scroll lock, Escape key dismissal, focus management, and a sticky header with close button.",
  "frontend/src/components/common/ToastContainer.tsx": "Renders a stack of toast notifications with success, error, and info variants, each dismissible via a close button.",
  "frontend/src/components/home/QuoteWidget.tsx": "Home page widget displaying the current daily quote with custom font/color/alignment styling, navigating to the Quote page on tap.",
  "frontend/src/components/home/StreakWidget.tsx": "Home page widget showing the current streak count and last check-in time (formatted via `formatDateTime`), linking to the Streak page.",
  "frontend/src/components/home/TodayRoutineWidget.tsx": "Home page widget displaying up to four items from today's routine profile with formatted times, linking to the Routines page.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component that composes the sidebar (desktop), main content area, and bottom tab bar (mobile) into a full-screen flex container.",
  "frontend/src/components/layout/AppSidebar.tsx": "Desktop-only sidebar with logo, navigation buttons for five app tabs, and a footer attribution link; hidden on mobile via Tailwind's md breakpoint.",
  "frontend/src/components/layout/BottomTabBar.tsx": "Mobile-only fixed bottom navigation bar rendering five tab buttons with active-state indicators; hidden on desktop via Tailwind's md breakpoint.",
  "frontend/src/components/notes/LabelManager.tsx": "Modal component for creating, renaming, and deleting note labels, with a color picker and an inline edit flow backed by the useLabels hook.",
  "frontend/src/components/notes/MultiSelectToolbar.tsx": "Fixed top toolbar shown during multi-note selection, displaying the selected count and action buttons for archiving, trashing, and clearing the selection.",
  "frontend/src/components/notes/NoteCard.tsx": "Masonry-style card component for displaying a single note with support for text, checklist, and image types, long-press selection, pin indicator, and a context menu.",
  "frontend/src/components/notes/NoteModal.tsx": "Full-screen modal for viewing and editing a note, supporting text, checklist, and image types with color picker, label picker, reminder, and image upload/compression.",
  "frontend/src/components/notes/QuickAddBar.tsx": "Collapsed input bar that expands to let the user choose between text, checklist, or image note types before triggering the onAdd callback.",
  "frontend/src/components/streak/CheckInButton.tsx": "Displays the current streak count and a check-in button that switches to a disabled 'Checked In' state with green styling once the user has checked in for the day.",
  "frontend/src/components/streak/StreakCalendar.tsx": "A React calendar component that displays a monthly view with check-in history highlighted, supporting month navigation via chevron buttons.",
  "frontend/src/db/db.ts": "Defines and exports a singleton OrganizerDB instance that groups all IndexedDB tables (notes, routines, records, streak, quotes, labels, imageBlobs, settings) using a Table wrapper.",
  "frontend/src/db/idb.ts": "A lightweight native IndexedDB wrapper providing a Table class with add, put, get, delete, toArray, count, and clear operations, replacing Dexie.",
  "frontend/src/db/schema.ts": "TypeScript interfaces defining the data shapes for all IndexedDB stores: Note, RoutineProfile, Record, StreakData, QuoteData, Label, ImageBlob, and AppSettings.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useImageStorage.ts": "A React hook providing saveImage, getImageUrl, and deleteImage helpers that persist and retrieve image blobs in IndexedDB via the imageBlobs table.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, clear, identity, and status state to child components.",
  "frontend/src/hooks/useLabels.ts": "A React hook that manages CRUD operations for labels stored in IndexedDB, exposing labels state along with createLabel, updateLabel, and deleteLabel functions.",
  "frontend/src/hooks/useNotes.ts": "A React hook managing notes in IndexedDB with support for filtering by view (all/archive/trash), search, and label, plus CRUD and trash/restore/archive operations.",
  "frontend/src/hooks/useQueries.ts": "Provides a usePing React Query hook that calls the backend actor's ping method, returning 'offline' if the actor is unavailable.",
  "frontend/src/hooks/useQuote.ts": "React hook for loading, saving, and rotating motivational quotes from IndexedDB, supporting shuffle and daily rotation modes.",
  "frontend/src/hooks/useRecords.ts": "React hook for managing journal/log records in IndexedDB with search, date filtering, CRUD operations, and JSON export.",
  "frontend/src/hooks/useRoutines.ts": "React hook for managing weekday and weekend routine profiles in IndexedDB, supporting add, update, delete, reorder, and toggle-complete operations on routine items.",
  "frontend/src/hooks/useScrollLock.ts": "React hook that locks and unlocks body scroll by toggling CSS position/overflow styles, preserving scroll position when unlocked.",
  "frontend/src/hooks/useStreak.ts": "React hook for tracking a daily check-in streak in IndexedDB, handling streak continuation, resets, and today's check-in status.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind layers, defines light/dark CSS custom properties (oklch color tokens), and provides utility component classes like note-card and masonry-grid.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/HomePage.tsx": "Home page component displaying a live clock/date header, streak, quote, and today's routine widgets, plus a floating quick-add note button.",
  "frontend/src/pages/NotesPage.tsx": "Notes page component supporting note creation, viewing, multi-select bulk actions, label management, and switching between all/archive/trash views.",
  "frontend/src/pages/QuotePage.tsx": "A settings/editor page for configuring a motivational quote widget, with live preview and options for font, color, alignment, blur, rotation mode, and a managed list of quotes.",
  "frontend/src/pages/RecordsPage.tsx": "A CRUD page for personal records with search, date filtering, export to JSON, and a modal form for adding or editing entries.",
  "frontend/src/pages/RoutinesPage.tsx": "A routines management page supporting weekday/weekend profiles with drag-and-drop reordering, completion toggling, and a modal form for adding or editing routine items.",
  "frontend/src/pages/SettingsPage.tsx": "An app settings page for toggling theme, accent color, font, background image, storage usage display, and full data export/import/clear functionality.",
  "frontend/src/pages/StreakPage.tsx": "A streak tracker page displaying the current streak count, a check-in button, stats summary, and a calendar view of check-in history.",
  "frontend/src/store/appStore.ts": "A Zustand store managing global app appearance state (theme, accent color, font) with functions to apply and persist each setting to the DOM and localStorage.",
  "frontend/src/store/toastStore.ts": "A Zustand store for managing toast notifications with auto-dismiss after 3.5 seconds, exposing helper functions for success, error, and info toasts.",
  "frontend/src/utils/dataValidation.ts": "Validates imported JSON data by checking that required top-level arrays (notes, routines, records, labels) are present and returns a result with any errors.",
  "frontend/src/utils/dateFormatter.ts": "Exports a `formatDateTime` utility that converts strings, numbers, or Date objects into a human-readable '28 Feb 2026, 3:45 AM' format, handling date-only strings and invalid input gracefully.",
  "frontend/src/utils/imageCompression.ts": "Provides `compressImage` and `generateThumbnail` functions that use a canvas to resize and compress image files to JPEG blobs with configurable max width and quality.",
  "frontend/src/utils/notificationService.ts": "Exports helpers to request browser notification permission and schedule a delayed browser notification at a specific timestamp.",
  "frontend/src/utils/seedData.ts": "Seeds the Dexie database with default notes, records, streak, quotes, and routines if each table is empty, providing initial demo content for new users.",
  "frontend/src/utils/serviceWorkerRegistration.ts": "Registers the app's service worker (`/sw.js`) on page load, silently ignoring failures so the app continues to function without it.",
  "frontend/src/utils/storage.ts": "Provides typed localStorage getters and setters for three UI settings: theme (light/dark), accent color, and font family.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, oklch-based semantic color tokens, border radii, box shadows, and animation keyframes, with dark mode via class and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks project metadata and feature state, recording one completed feature that replaced the HomePage greeting text from 'Good morning 👋' to 'Hi Dev...💛'."
}