{
  "backend/main.mo": "Minimal Motoko actor with a single `ping` query function that returns 'pong'.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (real-time clock on HomePage, new accent color options in SettingsPage/appStore, default light theme) to their source files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of key frontend source files, serving as a quick reference for the project's frontend structure.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom property color tokens for both light and dark themes, plus base body and border styles.",
  "frontend/index.html": "HTML shell for the React app, including PWA meta tags, Google Fonts preloads for Inter/Poppins/Roboto/Open Sans, and the root div with the main module script.",
  "frontend/public/manifest.json": "PWA web app manifest for 'MyOrganizer Pro' defining app name, icons, display mode, theme colors, and orientation.",
  "frontend/public/sw.js": "Service worker implementing a cache-first with network fallback strategy for static assets, with cache versioning and notification click handling.",
  "frontend/src/App.tsx": "Root React component managing tab-based navigation, lazy-loading Notes and Records pages, initializing app settings and seeding the database on mount, and registering the service worker.",
  "frontend/src/components/common/LoadingSpinner.tsx": "Provides a spinning `LoadingSpinner` component and a `PageSkeleton` placeholder used during lazy-loaded page suspense.",
  "frontend/src/components/common/Modal.tsx": "Accessible modal dialog component with scroll lock, Escape key handling, focus management, configurable sizes, and slide-up animation.",
  "frontend/src/components/common/ToastContainer.tsx": "Renders a stack of toast notifications (success, error, info) with icons and dismiss buttons, sourced from the toast Zustand store.",
  "frontend/src/components/home/QuoteWidget.tsx": "Home page widget that displays the current daily quote with custom font/color/alignment styling and navigates to the Quote page on tap.",
  "frontend/src/components/home/StreakWidget.tsx": "Home page widget showing the current streak count, last check-in date, and a today-checked indicator, navigating to the Streak page on tap.",
  "frontend/src/components/home/TodayRoutineWidget.tsx": "A clickable widget for the home screen that displays today's routine profile (up to 4 items) with formatted times, using the useRoutines hook to fetch the appropriate day profile.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component that composes the desktop sidebar, main scrollable content area, and mobile bottom tab bar into a full-screen flex layout.",
  "frontend/src/components/layout/AppSidebar.tsx": "Desktop-only sidebar with app logo, navigation buttons for all main tabs, and a footer attribution link; hidden on mobile via Tailwind's md breakpoint.",
  "frontend/src/components/layout/BottomTabBar.tsx": "Mobile-only fixed bottom navigation bar rendering five tab buttons with active-state indicators; hidden on desktop via Tailwind's md breakpoint.",
  "frontend/src/components/notes/LabelManager.tsx": "A modal component for creating, renaming, and deleting note labels, with color selection and inline editing powered by the useLabels hook.",
  "frontend/src/components/notes/MultiSelectToolbar.tsx": "A fixed top toolbar that appears during multi-note selection, showing the selected count and buttons to archive, trash, or clear the selection.",
  "frontend/src/components/notes/NoteCard.tsx": "A grid card component for displaying a single note with support for custom colors, pinning, selection via long-press, checklist/image previews, and a context menu for quick actions.",
  "frontend/src/components/notes/NoteModal.tsx": "A full-featured modal for viewing and editing a note, supporting text, checklist, and image note types with color picking, label assignment, reminders, and image upload with compression.",
  "frontend/src/components/notes/QuickAddBar.tsx": "A collapsible bar component that lets users choose a note type (text, checklist, or image) to quickly create a new note.",
  "frontend/src/components/streak/CheckInButton.tsx": "Displays the current streak count and a check-in button that becomes a disabled 'Checked In' state after the user checks in for the day.",
  "frontend/src/components/streak/StreakCalendar.tsx": "A navigable monthly calendar that highlights days the user has checked in, using a timestamp history array as input.",
  "frontend/src/db/db.ts": "Instantiates and exports a singleton OrganizerDB class that exposes typed Table instances for all app data stores (notes, routines, records, etc.).",
  "frontend/src/db/idb.ts": "A lightweight native IndexedDB wrapper providing a Table class with add, put, get, delete, toArray, count, and clear operations, replacing Dexie.",
  "frontend/src/db/schema.ts": "Defines TypeScript interfaces for all database entities including Note, RoutineProfile, Record, StreakData, QuoteData, Label, ImageBlob, and AppSettings.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useImageStorage.ts": "A React hook providing saveImage, getImageUrl, and deleteImage callbacks for managing image blobs in the IndexedDB imageBlobs store.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useLabels.ts": "A React hook that loads labels from IndexedDB and exposes createLabel, updateLabel, and deleteLabel operations with success/error toast notifications.",
  "frontend/src/hooks/useNotes.ts": "Custom React hook for managing notes stored in IndexedDB, providing CRUD operations, filtering by view/search/label, pinning, archiving, trashing, and bulk selection.",
  "frontend/src/hooks/useQueries.ts": "Minimal React Query hook that pings the backend actor to check connectivity, returning 'offline' if unavailable.",
  "frontend/src/hooks/useQuote.ts": "Custom hook for loading, saving, and rotating motivational quotes stored in IndexedDB, supporting shuffle and daily rotation modes.",
  "frontend/src/hooks/useRecords.ts": "Custom hook for managing journal/log records in IndexedDB with search, date-range filtering, CRUD operations, and JSON export.",
  "frontend/src/hooks/useRoutines.ts": "Custom hook for managing weekday and weekend routine profiles in IndexedDB, supporting item add/update/delete/reorder and completion toggling.",
  "frontend/src/hooks/useScrollLock.ts": "Custom hook that locks and unlocks body scroll by toggling CSS position/overflow styles, preserving scroll position on unlock.",
  "frontend/src/hooks/useStreak.ts": "Custom hook for tracking daily check-in streaks in IndexedDB, handling streak continuation, resets, and today's check-in status.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/components/utilities, OKLCH-based CSS design tokens for light and dark themes, and reusable component classes like note-card and masonry-grid.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/HomePage.tsx": "Renders the home dashboard with a live clock, greeting, and widgets for streak, quote, and today's routine, plus a floating quick-add note button and footer.",
  "frontend/src/pages/NotesPage.tsx": "Full-featured notes page supporting create, edit, archive, trash, multi-select bulk actions, label filtering, search, and a quick-add bar with note type selection.",
  "frontend/src/pages/QuotePage.tsx": "Quote editor page with live preview, allowing users to customize text, font, color, alignment, blur, rotation mode, and manage a list of rotating quotes.",
  "frontend/src/pages/RecordsPage.tsx": "Records management page with search, date-range filtering, add/edit/delete via modal, and JSON export functionality.",
  "frontend/src/pages/RoutinesPage.tsx": "Routines page with weekday/weekend/today tabs, drag-to-reorder items, completion toggling, and a form modal for adding or editing routine items with time, icon, and duration.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page for theme, accent color, font, background image upload/removal, storage usage display, and full data export/import with confirmation flow.",
  "frontend/src/pages/StreakPage.tsx": "Renders the Streak Tracker page showing current streak count, total check-ins, a check-in button, last check-in timestamp, and a calendar history view.",
  "frontend/src/store/appStore.ts": "Zustand store managing app-wide settings (theme, accent color, font family) with functions to apply and persist each setting via localStorage utilities and CSS variable manipulation.",
  "frontend/src/store/toastStore.ts": "Zustand store for managing toast notifications with add/remove actions and auto-dismiss after 3.5 seconds, plus helper functions for success, error, and info toasts.",
  "frontend/src/utils/dataValidation.ts": "Provides a `validateImportData` function that checks imported JSON for required arrays (notes, routines, records, labels) and returns a validation result with any errors.",
  "frontend/src/utils/imageCompression.ts": "Exports `compressImage` and `generateThumbnail` utilities that use a canvas to resize and compress image files to JPEG blobs at configurable dimensions and quality.",
  "frontend/src/utils/notificationService.ts": "Provides helpers to request browser notification permission and schedule a delayed browser notification at a specified timestamp.",
  "frontend/src/utils/seedData.ts": "Seeds the IndexedDB database with default notes, records, streak, quotes, and routines if each respective table is empty on first run.",
  "frontend/src/utils/serviceWorkerRegistration.ts": "Registers the app's service worker (`/sw.js`) on page load for PWA support, silently ignoring registration failures.",
  "frontend/src/utils/storage.ts": "Thin localStorage wrapper for persisting and retrieving the three user settings: theme, accent color, and font family.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, oklch-based color tokens, border radii, box shadows, and keyframe animations, with dark mode via class and typography/container-queries/animate plugins.",
  "project_state.json": "Project state metadata tracking existing features and pending feature requests for MyOrganizer Pro, including real-time date/time display, new accent color options (yellow/gold), and light theme as default."
}