{
  "backend/main.mo": "Motoko actor that manages a persistent key-value map of labels, exposing functions to initialize defaults, add, rename, delete, and query labels, with 'all' protected from modification or deletion.",
  "feature_evidence.json": "Feature evidence report mapping two features—useLabels hook CRUD operations with safe note reassignment on delete, and LabelManager modal UI—to their relevant source files and test IDs.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of each frontend source file, describing their roles in the MyOrganizer Pro app (truncated mid-entry).",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for light and dark modes, applied to base elements via @layer base.",
  "frontend/index.html": "HTML entry point for MyOrganizer Pro that loads two Google Fonts stylesheet links (covering Inter/Poppins/Roboto/Open Sans and Montserrat/Lato/Nunito/Playfair/etc.), sets PWA meta tags, and mounts the React app.",
  "frontend/public/manifest.json": "PWA web app manifest for MyOrganizer Pro defining app name, display mode, theme colors, and two icon sizes for home screen installation.",
  "frontend/public/sw.js": "Service worker implementing a cache-first with network fallback strategy for same-origin GET requests, with install/activate lifecycle handlers to manage cache versioning.",
  "frontend/src/App.tsx": "Root React component managing tab-based navigation across all app pages, lazy-loading Notes and Records, initializing settings and seeding the database on mount, and registering the service worker.",
  "frontend/src/components/common/LoadingSpinner.tsx": "Exports a spinning LoadingSpinner component in three sizes and a PageSkeleton placeholder used as Suspense fallbacks during lazy page loads.",
  "frontend/src/components/common/Modal.tsx": "Reusable accessible modal component with backdrop, Escape key handling, scroll lock, focus management, and configurable size variants rendered as a bottom sheet on mobile and centered dialog on desktop.",
  "frontend/src/components/common/ToastContainer.tsx": "Fixed-position toast notification container that renders success, error, and info toasts from the toast store with icons, dismiss buttons, and ARIA live region support.",
  "frontend/src/components/home/QuoteWidget.tsx": "Home page widget that displays the current daily quote (text, author, and custom styling) from the useQuote hook, navigating to the Quote page on tap.",
  "frontend/src/components/home/StreakWidget.tsx": "A clickable home widget that displays the user's current check-in streak count, last check-in time, and a 'Today' badge if already checked in today.",
  "frontend/src/components/home/TodayRoutineWidget.tsx": "A clickable home widget that shows up to 4 items from today's routine profile (weekday/weekend), with formatted times and an overflow count.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component that composes the desktop sidebar, scrollable main content area, and mobile bottom tab bar.",
  "frontend/src/components/layout/AppSidebar.tsx": "Desktop-only sidebar with app logo, navigation buttons for all main tabs, and a footer attribution link; hidden on mobile.",
  "frontend/src/components/layout/BottomTabBar.tsx": "Mobile-only fixed bottom navigation bar rendering icon+label tab buttons with active state indicators; hidden on desktop.",
  "frontend/src/components/notes/LabelManager.tsx": "Modal dialog for creating, renaming, and deleting note labels, including a confirmation overlay before deletion that reassigns affected notes.",
  "frontend/src/components/notes/MultiSelectToolbar.tsx": "Fixed top toolbar shown during multi-note selection, providing Archive, Trash, and Clear-selection actions with a selected-count display.",
  "frontend/src/components/notes/NoteCard.tsx": "Grid card component for a single note that supports long-press selection, custom background colors, pin indicator, and previews for text, checklist, and image note types.",
  "frontend/src/components/notes/NoteModal.tsx": "Full-screen modal for viewing and editing a note's title, content, checklist items, color, labels, reminder, and image, with save/trash/archive/pin actions.",
  "frontend/src/components/notes/QuickAddBar.tsx": "A collapsible bar component that lets users initiate note creation by selecting a note type (text, checklist, or image) from an expanded button panel.",
  "frontend/src/components/streak/CheckInButton.tsx": "Displays the current streak count and a check-in button that toggles to a 'Checked In' state with visual feedback once the user has checked in for the day.",
  "frontend/src/components/streak/StreakCalendar.tsx": "A monthly calendar component that highlights days the user checked in, with navigation controls to browse previous and next months.",
  "frontend/src/db/db.ts": "Instantiates and exports a singleton OrganizerDB class that exposes typed Table instances for all app data stores (notes, routines, records, streak, quotes, labels, imageBlobs, settings).",
  "frontend/src/db/idb.ts": "A lightweight native IndexedDB wrapper providing a Table class with add, put, get, delete, toArray, count, and clear operations, replacing Dexie for local persistence.",
  "frontend/src/db/schema.ts": "Defines TypeScript interfaces for all database entities including Note, RoutineProfile, Record, StreakData, QuoteData, Label, ImageBlob, and AppSettings.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useImageStorage.ts": "A React hook providing saveImage, getImageUrl, and deleteImage callbacks for managing image blobs (full and thumbnail) in the IndexedDB imageBlobs store.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient-based login, logout, and identity state across the app.",
  "frontend/src/hooks/useLabels.ts": "A React hook for CRUD operations on labels stored in IndexedDB, including duplicate/reserved-name guards and optional note reassignment on label deletion.",
  "frontend/src/hooks/useNotes.ts": "Custom React hook that manages notes CRUD operations (create, update, delete, trash, archive, restore) against IndexedDB, with filtering by view, search query, and label, plus bulk selection support.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and initializing labels from the ICP backend actor, while all other data is stored locally in IndexedDB.",
  "frontend/src/hooks/useQuote.ts": "Custom hook that loads, saves, and rotates motivational quotes stored in IndexedDB, supporting shuffle and daily rotation modes.",
  "frontend/src/hooks/useRecords.ts": "Custom hook for managing journal/log records in IndexedDB with search and date-range filtering, plus JSON export functionality.",
  "frontend/src/hooks/useRoutines.ts": "Custom hook that manages weekday and weekend routine profiles in IndexedDB, supporting add, update, delete, reorder, and toggle-complete operations on routine items.",
  "frontend/src/hooks/useScrollLock.ts": "Custom hook that locks and unlocks body scroll by toggling CSS position/overflow styles, preserving the scroll position when unlocked.",
  "frontend/src/hooks/useStreak.ts": "Custom hook that tracks a daily check-in streak in IndexedDB, incrementing or resetting the count based on whether the last check-in was yesterday.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind layers, defines light/dark CSS custom properties (oklch color tokens), and provides utility component classes like note-card and masonry-grid.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query's QueryClientProvider and a custom InternetIdentityProvider for ICP authentication.",
  "frontend/src/pages/HomePage.tsx": "Renders the home dashboard with a live clock, streak/quote/routine widgets, a quick-add note FAB, and a footer attribution link.",
  "frontend/src/pages/NotesPage.tsx": "Full-featured notes page supporting create/edit/archive/trash/delete, multi-select bulk actions, label filtering, search, and a quick-add flow triggered from the home page.",
  "frontend/src/pages/QuotePage.tsx": "Settings page for a motivational quote widget, allowing users to edit quote text/author, typography, alignment, rotation mode, and manage a list of rotating quotes with a live preview.",
  "frontend/src/pages/RecordsPage.tsx": "CRUD page for personal records with search, date-range filtering, add/edit modal, delete, and JSON export functionality.",
  "frontend/src/pages/RoutinesPage.tsx": "Routine manager with weekday/weekend/today tabs, drag-and-drop reordering, completion toggling, and an add/edit modal with icon picker and duration support.",
  "frontend/src/pages/SettingsPage.tsx": "App settings page covering theme/accent/font customization, background image upload, storage usage display, and data export/import/clear operations.",
  "frontend/src/pages/StreakPage.tsx": "React page component that displays the user's daily check-in streak, showing current streak count, total check-ins, last check-in time, and a calendar history view.",
  "frontend/src/store/appStore.ts": "Zustand store managing global app settings (theme, accent color, font family) with preset color definitions and DOM-applied CSS variable updates persisted via localStorage utilities.",
  "frontend/src/store/toastStore.ts": "Zustand store for managing toast notifications with add/remove operations and auto-dismiss after 3.5 seconds, plus convenience helper functions for success, error, and info toasts.",
  "frontend/src/utils/dataValidation.ts": "Validates imported JSON data by checking for required top-level arrays (notes, routines, records, labels) and returns a validation result with any errors found.",
  "frontend/src/utils/dateFormatter.ts": "Utility function that formats date strings, timestamps, or Date objects into a human-readable '28 Feb 2026, 3:45 AM' format, handling date-only strings and invalid inputs gracefully.",
  "frontend/src/utils/imageCompression.ts": "Provides two canvas-based image processing utilities: compressImage resizes and JPEG-compresses a File to a max width, and generateThumbnail creates a smaller 300px-wide thumbnail.",
  "frontend/src/utils/notificationService.ts": "Utility for requesting browser notification permission and scheduling a delayed browser notification to fire at a specified timestamp.",
  "frontend/src/utils/seedData.ts": "Seeds the IndexedDB database with default notes, records, streak, quotes, and routines on first run if the respective tables are empty.",
  "frontend/src/utils/serviceWorkerRegistration.ts": "Registers the app's service worker (/sw.js) on page load for PWA support, silently ignoring registration failures.",
  "frontend/src/utils/storage.ts": "Thin localStorage wrapper for reading and writing the three user settings: theme (light/dark), accent color, and font family.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom font families, oklch-based semantic color tokens mapped to CSS variables, extended border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing the current feature set, pending architectural requests, and implementation notes for adding configurable label/tag management to the Notes section."
}