{
  "backend/main.mo": "Minimal Motoko actor exposing a single `ping` query function that returns the string 'pong'.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their IDs, titles, affected files, component dependencies, test IDs, and confidence levels for font-related additions across the frontend.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short human-readable summaries describing each file's purpose and recent changes.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes, applied to base elements via @layer base.",
  "frontend/index.html": "HTML entry point for MyOrganizer Pro that loads PWA meta tags, two Google Fonts stylesheet links covering 13 font families, and the React app via /src/main.tsx.",
  "frontend/public/manifest.json": "PWA web app manifest for MyOrganizer Pro defining name, display mode, theme colors, and two icon sizes.",
  "frontend/public/sw.js": "Service worker implementing a cache-first with network-update strategy for same-origin GET requests, with install/activate lifecycle management and notification click handling.",
  "frontend/src/App.tsx": "Root React component managing tab-based navigation between all app pages, lazy-loading Notes and Records, initializing settings and seeding the database on mount, and registering the service worker.",
  "frontend/src/components/common/LoadingSpinner.tsx": "Exports a spinning `LoadingSpinner` component in three sizes and a `PageSkeleton` placeholder used as a Suspense fallback.",
  "frontend/src/components/common/Modal.tsx": "Accessible modal dialog component with backdrop, Escape-key dismissal, scroll lock, focus management, and five size variants.",
  "frontend/src/components/common/ToastContainer.tsx": "Fixed-position toast notification container that renders success, error, and info toasts from the toast store with dismiss buttons.",
  "frontend/src/components/home/QuoteWidget.tsx": "Home-page quote widget that displays the current quote's text, author, and custom styling (font, size, color, alignment) and navigates to the Quote page on tap.",
  "frontend/src/components/home/StreakWidget.tsx": "A clickable home widget that displays the user's current check-in streak count, last check-in time, and a 'Today' badge if already checked in today.",
  "frontend/src/components/home/TodayRoutineWidget.tsx": "A clickable home widget that shows up to 4 items from today's routine profile (weekday/weekend), with formatted times and a count of remaining items.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component that composes the desktop sidebar, scrollable main content area, and mobile bottom tab bar into a full-screen flex layout.",
  "frontend/src/components/layout/AppSidebar.tsx": "Desktop-only sidebar with app logo, navigation buttons for all main tabs, active state indicators, and a footer attribution link to caffeine.ai.",
  "frontend/src/components/layout/BottomTabBar.tsx": "Mobile-only fixed bottom navigation bar rendering icon+label tab buttons with active state styling and ARIA attributes.",
  "frontend/src/components/notes/LabelManager.tsx": "A modal for creating, renaming, and deleting note labels, with color selection for new labels and inline editing for existing ones.",
  "frontend/src/components/notes/MultiSelectToolbar.tsx": "A fixed top toolbar shown during multi-note selection that displays the selected count and provides Archive, Trash, and Clear selection actions.",
  "frontend/src/components/notes/NoteCard.tsx": "A grid card component for a single note that supports long-press selection, pin/archive/trash context actions, color backgrounds, and previews for text, checklist, and image note types.",
  "frontend/src/components/notes/NoteModal.tsx": "A full-featured modal for viewing and editing a note, supporting text, checklist, and image types with color picking, label assignment, reminder scheduling, and image upload with compression.",
  "frontend/src/components/notes/QuickAddBar.tsx": "A collapsible bar component that lets users choose a note type (text, checklist, or image) to create a new note. Expands on click to show type selection buttons, then collapses after a selection or cancel.",
  "frontend/src/components/streak/CheckInButton.tsx": "Displays the current streak count and a check-in button that becomes a disabled 'Checked In' state after the user checks in for the day.",
  "frontend/src/components/streak/StreakCalendar.tsx": "A monthly calendar component that highlights days the user checked in, with navigation between months and a legend showing total check-in count.",
  "frontend/src/db/db.ts": "Instantiates and exports a singleton OrganizerDB object that exposes typed Table instances for all app data stores (notes, routines, records, streak, quotes, labels, imageBlobs, settings).",
  "frontend/src/db/idb.ts": "A lightweight native IndexedDB wrapper that provides a Table class with add, put, get, delete, toArray, count, and clear operations, replacing Dexie for local persistence.",
  "frontend/src/db/schema.ts": "Defines TypeScript interfaces for all database entities: Note, RoutineProfile, Record, StreakData, QuoteData, Label, ImageBlob, and AppSettings.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, returning either an authenticated or anonymous actor and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useImageStorage.ts": "A React hook providing saveImage, getImageUrl, and deleteImage callbacks for storing and retrieving image blobs in the IndexedDB imageBlobs table.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useLabels.ts": "A React hook that loads labels from IndexedDB and exposes createLabel, updateLabel, and deleteLabel operations with success/error toast notifications.",
  "frontend/src/hooks/useNotes.ts": "Custom React hook for managing notes stored in IndexedDB, providing CRUD operations, filtering by view/search/label, pinning, archiving, trashing, and bulk selection.",
  "frontend/src/hooks/useQueries.ts": "Minimal React Query hook that pings the backend actor to check connectivity, returning 'offline' if unavailable.",
  "frontend/src/hooks/useQuote.ts": "Custom hook for loading, saving, and rotating motivational quotes stored in IndexedDB, supporting shuffle and daily rotation modes.",
  "frontend/src/hooks/useRecords.ts": "Custom hook for managing journal/log records in IndexedDB with search, date-range filtering, CRUD operations, and JSON export.",
  "frontend/src/hooks/useRoutines.ts": "Custom hook for managing weekday and weekend routine profiles in IndexedDB, supporting item add/update/delete/reorder and completion toggling.",
  "frontend/src/hooks/useScrollLock.ts": "Hook that locks and unlocks body scroll by toggling CSS position/overflow styles, preserving scroll position when unlocked.",
  "frontend/src/hooks/useStreak.ts": "Custom hook for tracking daily check-in streaks in IndexedDB, handling streak increment, reset on missed days, and today's check-in status.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/components/utilities, OKLCH CSS design tokens for light and dark themes, and custom utility classes for layout and note cards.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/HomePage.tsx": "Renders the home dashboard with a live clock, streak/quote/routine widgets, a quick-add note FAB, and a footer attribution link.",
  "frontend/src/pages/NotesPage.tsx": "Full-featured notes page supporting create/edit/archive/trash/delete, multi-select bulk actions, label filtering, search, and a quick-add flow triggered from the home page.",
  "frontend/src/pages/QuotePage.tsx": "Settings page for a motivational quote widget, allowing users to edit quote text/author, typography, alignment, rotation mode, and manage a quote list with a live preview.",
  "frontend/src/pages/RecordsPage.tsx": "CRUD page for personal records with search, date-range filtering, add/edit modal, delete, and JSON export functionality.",
  "frontend/src/pages/RoutinesPage.tsx": "Routine manager with weekday/weekend/today tabs, drag-and-drop reordering, completion toggling, and a form modal for adding or editing routine items.",
  "frontend/src/pages/SettingsPage.tsx": "App settings page covering theme/accent/font customization, background image upload, storage usage display, and data export/import/clear operations.",
  "frontend/src/pages/StreakPage.tsx": "React page component that displays the user's streak tracker, including current streak count, total check-ins, a check-in button, last check-in timestamp, and a calendar history view.",
  "frontend/src/store/appStore.ts": "Zustand store managing global app settings (theme, accent color, font family) with preset accent color definitions and functions to apply and persist each setting to the DOM and localStorage.",
  "frontend/src/store/toastStore.ts": "Zustand store for managing toast notifications with add/remove actions and auto-dismiss after 3.5 seconds, plus helper functions for success, error, and info toasts.",
  "frontend/src/utils/dataValidation.ts": "Validates imported JSON data by checking that required arrays (notes, routines, records, labels) are present, returning a validation result with any errors.",
  "frontend/src/utils/dateFormatter.ts": "Utility function that formats a date string, number, or Date object into a human-readable '28 Feb 2026, 3:45 AM' format, handling date-only strings and invalid inputs gracefully.",
  "frontend/src/utils/imageCompression.ts": "Provides canvas-based image compression utilities: `compressImage` resizes and JPEG-compresses a File to a Blob, and `generateThumbnail` creates a smaller 300px-wide thumbnail.",
  "frontend/src/utils/notificationService.ts": "Handles browser notification permission requests and schedules a delayed browser notification to fire at a specified timestamp.",
  "frontend/src/utils/seedData.ts": "Seeds the IndexedDB database with default notes, records, streak, quotes, and routines if those tables are empty, providing initial sample data for new users.",
  "frontend/src/utils/serviceWorkerRegistration.ts": "Registers the app's service worker (`/sw.js`) on page load if the browser supports it, silently ignoring registration failures.",
  "frontend/src/utils/storage.ts": "Thin localStorage wrapper for persisting and retrieving the three app settings: theme, accent color, and font family.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme with multiple font families (including Castellar with Cinzel Decorative fallback), oklch-based semantic color tokens, custom border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing the current version, architectural notes, and a list of existing implemented features related to font family selection and customization settings."
}