{
  "backend/main.mo": "Motoko actor managing a persistent key-value map of labels, with functions to initialize defaults, add, rename, delete, and query labels.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (record export utility, export UI buttons, speech-to-text mic button) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing their purpose and notable changes across the project.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark color themes, plus base body and border styles.",
  "frontend/index.html": "HTML entry point for MyOrganizer Pro PWA, loading two Google Fonts stylesheet links (Inter/Poppins/Roboto/Open Sans and Montserrat/Lato/Nunito/etc.) and the React app root script.",
  "frontend/public/manifest.json": "PWA web app manifest for MyOrganizer Pro defining app name, display mode, theme colors, and two icon sizes for home screen installation.",
  "frontend/public/sw.js": "Service worker implementing a cache-first with network update strategy for static assets, with install, activate, fetch, and notification-click event handlers.",
  "frontend/src/App.tsx": "Root React component managing tab-based navigation across all app pages, lazy-loading NotesPage and RecordsPage, and initializing settings, seed data, and service worker on mount.",
  "frontend/src/components/common/LoadingSpinner.tsx": "Exports a spinning LoadingSpinner component in three sizes and a PageSkeleton placeholder used as Suspense fallbacks during lazy page loads.",
  "frontend/src/components/common/Modal.tsx": "Reusable accessible modal component with scroll lock, Escape key handling, focus management, configurable size, and a sticky header with optional close button.",
  "frontend/src/components/common/ToastContainer.tsx": "Fixed-position toast notification container that renders success, error, and info toasts from the toast store with icons and dismiss buttons.",
  "frontend/src/components/home/QuoteWidget.tsx": "A clickable home widget that displays the user's daily quote (text, author, and styling) using the useQuote hook, with a navigation callback on click.",
  "frontend/src/components/home/StreakWidget.tsx": "A clickable home widget showing the user's current streak count, last check-in time, and a today indicator using the useStreak hook.",
  "frontend/src/components/home/TodayRoutineWidget.tsx": "A clickable home widget that displays up to 4 items from today's routine profile (determined by day type) using the useRoutines hook.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component that composes the desktop AppSidebar, main content area, and mobile BottomTabBar with active tab state.",
  "frontend/src/components/layout/AppSidebar.tsx": "Desktop-only sidebar with logo, navigation buttons for all app tabs, and a footer attribution link; hidden on mobile via Tailwind.",
  "frontend/src/components/layout/BottomTabBar.tsx": "Mobile-only fixed bottom navigation bar rendering tab buttons with active state indicators; hidden on desktop via Tailwind.",
  "frontend/src/components/notes/LabelManager.tsx": "Modal dialog for creating, renaming, and deleting note labels, including a confirmation overlay before deletion and bulk label reassignment on delete.",
  "frontend/src/components/notes/MultiSelectToolbar.tsx": "Fixed top toolbar shown during multi-note selection, providing archive, trash, and export (TXT/DOC/JSON) actions for the selected notes.",
  "frontend/src/components/notes/NoteCard.tsx": "Card component for displaying a single note with support for selection (long-press or checkbox), pin indicator, color theming, and context menu actions (pin, archive, trash).",
  "frontend/src/components/notes/NoteModal.tsx": "A modal component for creating and editing notes that supports text, checklist, and image note types with features including color picking, label selection, reminders, speech recognition, and export functionality.",
  "frontend/src/components/notes/QuickAddBar.tsx": "A collapsible bar component that lets users quickly create a new note by selecting from text, checklist, or image note types.",
  "frontend/src/components/streak/CheckInButton.tsx": "A button component that displays the current streak count and allows users to check in for the day, showing a disabled confirmed state after check-in.",
  "frontend/src/components/streak/StreakCalendar.tsx": "A monthly calendar component that visually highlights days the user has checked in, with navigation between months.",
  "frontend/src/db/db.ts": "Instantiates and exports a singleton OrganizerDB class that exposes typed Table instances for all app data stores (notes, routines, records, streak, quotes, labels, imageBlobs, settings).",
  "frontend/src/db/idb.ts": "A lightweight native IndexedDB wrapper that provides a Table class with CRUD operations (add, put, get, delete, toArray, count, clear) and handles database initialization with store/index creation.",
  "frontend/src/db/schema.ts": "Defines TypeScript interfaces for all database entities including Note, RoutineProfile, Record, StreakData, QuoteData, Label, ImageBlob, and AppSettings.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an Internet Computer actor using the current identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useImageStorage.ts": "A React hook providing saveImage, getImageUrl, and deleteImage callbacks for storing and retrieving image blobs in the IndexedDB imageBlobs table.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useLabels.ts": "Custom hook for managing labels in IndexedDB, providing CRUD operations (create, update, delete) with duplicate/reserved-name guards and toast notifications.",
  "frontend/src/hooks/useNotes.ts": "Custom hook for managing notes in IndexedDB, supporting create/update/delete/trash/archive/restore operations, filtering by view, search, and label, and bulk selection.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching all labels and initializing default labels via the backend actor, with IndexedDB used for all other data.",
  "frontend/src/hooks/useQuote.ts": "Custom hook for managing a motivational quote stored in IndexedDB, supporting save and rotation (shuffle or daily) modes.",
  "frontend/src/hooks/useRecords.ts": "Custom hook for managing records in IndexedDB with CRUD operations, search/date filtering, and JSON export functionality.",
  "frontend/src/hooks/useRoutines.ts": "Custom hook for managing weekday and weekend routine profiles in IndexedDB, supporting item add/update/delete/reorder and completion toggling.",
  "frontend/src/hooks/useScrollLock.ts": "Custom hook that locks and unlocks body scroll by toggling CSS styles, preserving the scroll position when unlocked.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom React hook that wraps the browser's SpeechRecognition API, exposing controls to start/stop listening and state for transcripts, interim results, and errors.",
  "frontend/src/hooks/useStreak.ts": "Custom React hook that loads and manages a daily check-in streak from IndexedDB, handling streak counting, broken streaks, and toast notifications.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind layers, and defines CSS custom properties for light/dark theme tokens including colors, typography, and app-specific variables.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/HomePage.tsx": "Home page component displaying a live clock, greeting, streak/quote/routine widgets, a quick-add note FAB, and a footer attribution link.",
  "frontend/src/pages/NotesPage.tsx": "Full-featured notes page supporting search, label filtering, multi-select, note creation/editing via modal, and import/export in TXT, DOC, and JSON formats.",
  "frontend/src/pages/QuotePage.tsx": "Quote settings page allowing users to edit, style (font, size, color, alignment), and manage a rotating list of motivational quotes with a live preview.",
  "frontend/src/pages/RecordsPage.tsx": "A full-featured records management page with IndexedDB persistence for storing text entries with tags, images, and speech-to-text input, plus export functionality in TXT, DOC, and JSON formats.",
  "frontend/src/pages/RoutinesPage.tsx": "A routines management page supporting weekday/weekend profiles with drag-and-drop reordering, CRUD operations, speech recognition for input, and import/export in multiple formats.",
  "frontend/src/pages/SettingsPage.tsx": "A settings page for customizing theme, accent color, font family, and background image, with storage usage display and full data import/export and clear functionality.",
  "frontend/src/pages/StreakPage.tsx": "A streak tracker page displaying current streak count, total check-ins, a check-in button, and a calendar view of check-in history.",
  "frontend/src/store/appStore.ts": "Zustand store managing global app settings (theme, accent color, font) with functions to apply and persist each setting to the DOM and localStorage.",
  "frontend/src/store/toastStore.ts": "Zustand store for managing toast notifications with auto-dismiss after 3.5 seconds and helper functions for success, error, and info toasts.",
  "frontend/src/utils/dataValidation.ts": "Validates the structure of imported JSON data, checking for required arrays (notes, routines, records, labels) and returning a result with any errors.",
  "frontend/src/utils/dateFormatter.ts": "Utility function that formats dates, timestamps, or strings into a human-readable '28 Feb 2026, 3:45 AM' format, handling edge cases like date-only strings and invalid input.",
  "frontend/src/utils/imageCompression.ts": "Utility functions to compress images to a specified max width and quality using an HTML canvas, with a separate helper for generating thumbnails.",
  "frontend/src/utils/noteExport.ts": "Provides functions to export notes (all or selected) as TXT, DOC, or JSON files by formatting note content and triggering browser downloads.",
  "frontend/src/utils/noteImport.ts": "Handles importing notes from JSON, TXT, or DOC files, parsing each format into Note objects with unique IDs and saving them to the database.",
  "frontend/src/utils/notificationService.ts": "Provides utilities to request browser notification permission and schedule a delayed browser notification at a specified timestamp.",
  "frontend/src/utils/recordExport.ts": "Exports record entries as TXT, DOC, or JSON files, extracting title, body, date, and tags from each record and triggering browser downloads.",
  "frontend/src/utils/routineExport.ts": "Exports routine profiles and their items as TXT, DOC, or JSON files, formatting profile and item details and triggering browser downloads.",
  "frontend/src/utils/routineImport.ts": "Parses routine profiles from JSON, TXT, or DOC files into RoutineProfile objects with generated IDs and saves them to the database.",
  "frontend/src/utils/seedData.ts": "Seeds the IndexedDB database with initial sample data for notes, records, streaks, quotes, and routines if those tables are empty on first run.",
  "frontend/src/utils/serviceWorkerRegistration.ts": "Registers the app's service worker (/sw.js) on page load to enable offline/PWA functionality, silently ignoring registration failures.",
  "frontend/src/utils/storage.ts": "Provides localStorage get/set helpers for small UI settings: theme (light/dark), accent color, and font family.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom font families, OKLCH-based color tokens, border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current project state including version, architectural notes, known issues, and a list of implemented features for the Records and Routines sections (export formats, speech-to-text, image attachments)."
}