{
  "backend/main.mo": "Motoko actor implementing a persistent labels store with CRUD operations (add, rename, delete, get, getAll) and a default label initializer; protects the 'all' label from modification or deletion.",
  "feature_evidence.json": "Feature evidence report listing implemented features (speech-to-text mic button in NoteModal and client-side Export as Document) with associated file paths, component dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's role, used as build planning documentation for the frontend codebase.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, including color tokens for backgrounds, borders, charts, and sidebar elements.",
  "frontend/index.html": "HTML shell for MyOrganizer Pro PWA; loads two Google Fonts stylesheets (Inter/Poppins/Roboto/Open Sans and an extended set), sets PWA meta tags, and mounts the React app via main.tsx.",
  "frontend/public/manifest.json": "PWA web app manifest for MyOrganizer Pro defining app name, display mode, theme colors, orientation, and two icon sizes (192×192 and 512×512).",
  "frontend/public/sw.js": "Service worker implementing a cache-first with network fallback strategy for same-origin GET requests, with static asset pre-caching on install and old cache cleanup on activate.",
  "frontend/src/App.tsx": "Root React component managing tab-based navigation across all app pages, lazy-loading Notes and Records pages, initializing settings and seeding the database on mount, and registering the service worker.",
  "frontend/src/components/common/LoadingSpinner.tsx": "Exports a spinning LoadingSpinner component with three size variants and a PageSkeleton component showing pulsing placeholder blocks for lazy-loaded pages.",
  "frontend/src/components/common/Modal.tsx": "Reusable modal dialog component with backdrop blur, slide-up animation, configurable size, Escape-key dismissal, scroll lock, and optional title/close button.",
  "frontend/src/components/common/ToastContainer.tsx": "Fixed-position toast notification container that renders success, error, and info toasts from the toast store with icons, slide-up animation, and dismiss buttons.",
  "frontend/src/components/home/QuoteWidget.tsx": "A clickable home widget that displays the user's daily quote (text, author, and styling) using the useQuote hook, with a fallback prompt if no quote exists.",
  "frontend/src/components/home/StreakWidget.tsx": "A clickable home widget showing the user's current check-in streak count, last check-in time, and a today indicator using the useStreak hook.",
  "frontend/src/components/home/TodayRoutineWidget.tsx": "A clickable home widget that previews up to four items from today's routine profile (determined by day type) using the useRoutines hook.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component that composes the desktop AppSidebar, a scrollable main content area, and the mobile BottomTabBar around child content.",
  "frontend/src/components/layout/AppSidebar.tsx": "Desktop-only sidebar with app logo, navigation buttons for all main tabs, and a footer attribution link; hidden on mobile via Tailwind.",
  "frontend/src/components/layout/BottomTabBar.tsx": "Mobile-only fixed bottom navigation bar rendering icon+label tab buttons for the five main app sections; hidden on desktop via Tailwind.",
  "frontend/src/components/notes/LabelManager.tsx": "Modal dialog for managing note labels, supporting create, inline rename, and delete (with a confirmation overlay that bulk-reassigns affected notes before deletion).",
  "frontend/src/components/notes/MultiSelectToolbar.tsx": "Fixed top toolbar shown during multi-select mode in the notes list, displaying the selected count and Archive/Trash action buttons.",
  "frontend/src/components/notes/NoteCard.tsx": "Grid card component for a single note that supports long-press selection, custom background color, pin indicator, and context-menu actions (pin, archive, trash) with previews for text, checklist, and image note types.",
  "frontend/src/components/notes/NoteModal.tsx": "A modal component for creating and editing notes, supporting text, checklist, and image types with features like color picking, label selection, reminders, speech recognition, and export to doc.",
  "frontend/src/components/notes/QuickAddBar.tsx": "A collapsible bar component that lets users quickly create a new note by selecting between text, checklist, or image note types.",
  "frontend/src/components/streak/CheckInButton.tsx": "Displays the current streak count and a button to check in for the day, showing a confirmed state once the user has already checked in.",
  "frontend/src/components/streak/StreakCalendar.tsx": "Renders a monthly calendar view highlighting days the user checked in, with navigation between months and a legend showing total check-in days.",
  "frontend/src/db/db.ts": "Instantiates and exports a singleton OrganizerDB class that exposes typed Table instances for all app data stores (notes, routines, records, streak, quotes, labels, imageBlobs, settings).",
  "frontend/src/db/idb.ts": "A lightweight native IndexedDB wrapper that provides a generic Table class with add, put, get, delete, toArray, count, and clear operations, replacing Dexie.",
  "frontend/src/db/schema.ts": "Defines TypeScript interfaces for all database entities including Note, RoutineProfile, Record, StreakData, QuoteData, Label, ImageBlob, and AppSettings.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an Internet Computer actor using the current identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useImageStorage.ts": "A React hook providing saveImage, getImageUrl, and deleteImage callbacks for storing and retrieving image blobs in the IndexedDB imageBlobs table.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useLabels.ts": "Custom hook for managing labels in IndexedDB, providing CRUD operations (create, update, delete) with duplicate/reserved-name guards and toast notifications.",
  "frontend/src/hooks/useNotes.ts": "Custom hook for managing notes in IndexedDB, supporting create/update/delete/trash/archive/restore operations, filtering by view, search, and label, and bulk selection.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching all labels and initializing default labels via the backend actor, with IndexedDB used for all other data.",
  "frontend/src/hooks/useQuote.ts": "Custom hook for managing a motivational quote stored in IndexedDB, supporting save and rotation (shuffle or daily) modes.",
  "frontend/src/hooks/useRecords.ts": "Custom hook for managing records in IndexedDB with CRUD operations, search/date filtering, and JSON export functionality.",
  "frontend/src/hooks/useRoutines.ts": "Custom hook for managing weekday and weekend routine profiles in IndexedDB, supporting item add/update/delete/reorder and completion toggling.",
  "frontend/src/hooks/useScrollLock.ts": "Custom hook that locks and unlocks body scroll by toggling CSS styles, preserving the scroll position when unlocked.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom React hook that wraps the browser's Web Speech API to provide speech-to-text functionality, exposing start/stop controls, final and interim transcripts, and error state.",
  "frontend/src/hooks/useStreak.ts": "Custom React hook that manages a daily check-in streak using IndexedDB via Dexie, handling streak counting, broken streak resets, and toast notifications.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind base/components/utilities, and defines OKLCH-based CSS custom properties for light and dark themes including app-specific tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/HomePage.tsx": "Home page component displaying a live clock, greeting, and dashboard widgets (streak, quote, today's routine) along with a floating action button for quick note creation.",
  "frontend/src/pages/NotesPage.tsx": "Notes page that provides full note management including search, label filtering, view switching, multi-select bulk actions, note creation/editing via a modal, and label management.",
  "frontend/src/pages/QuotePage.tsx": "Quote settings page allowing users to configure a motivational quote's text, author, font, size, color, alignment, background blur, rotation mode, and a custom quote list with live preview.",
  "frontend/src/pages/RecordsPage.tsx": "Page component for managing records with search, date filtering, add/edit/delete via modal, and JSON export functionality.",
  "frontend/src/pages/RoutinesPage.tsx": "Page component for managing weekday/weekend routine items with tabs, drag-and-drop reordering, completion toggling, and add/edit/delete via modal.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page for customizing theme, accent color, font family, background image, and handling data export/import/clear with storage usage display.",
  "frontend/src/pages/StreakPage.tsx": "Page displaying the user's daily check-in streak with current count, total check-ins, last check-in time, and a calendar history view.",
  "frontend/src/store/appStore.ts": "Zustand store managing global app appearance state (theme, accent color, font) with persistence via localStorage utilities and CSS variable application.",
  "frontend/src/store/toastStore.ts": "Zustand store for managing toast notifications with auto-dismiss after 3.5 seconds and helper functions for success, error, and info toasts.",
  "frontend/src/utils/dataValidation.ts": "Validates imported JSON data by checking for required top-level arrays (notes, routines, records, labels) and returning a result with any errors.",
  "frontend/src/utils/dateFormatter.ts": "Utility function that formats a date string, number, or Date object into a human-readable '28 Feb 2026, 3:45 AM' format, handling edge cases safely.",
  "frontend/src/utils/imageCompression.ts": "Utility functions to compress images to JPEG using a canvas element with configurable max width and quality, plus a thumbnail generator shortcut.",
  "frontend/src/utils/noteExport.ts": "Provides a client-side `exportNoteAsDoc` function that converts a Note (text or checklist) into a Word-compatible HTML blob and triggers a browser download with a sanitized, timestamped filename.",
  "frontend/src/utils/notificationService.ts": "Exports two utilities: one to request browser notification permission and one to schedule a native browser notification at a specified future timestamp using `setTimeout`.",
  "frontend/src/utils/seedData.ts": "Seeds the IndexedDB database with default notes, a log record, streak entry, motivational quotes, and weekday/weekend routines if each respective table is empty.",
  "frontend/src/utils/serviceWorkerRegistration.ts": "Registers the `/sw.js` service worker on page load if the browser supports it, silently ignoring failures so the app continues to work without a SW.",
  "frontend/src/utils/storage.ts": "Provides typed get/set helpers for persisting three UI settings (theme, accent color, font family) in `localStorage` using fixed key constants.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that enables dark mode via class, registers typography/container-queries/animate plugins, and extends the theme with custom fonts, OKLCH-based semantic colors, border radii, and box shadows.",
  "project_state.json": "Tracks the project's current state including version, architectural notes, known issues, and a list of implemented features such as speech-to-text in NoteModal and client-side DOC export for notes."
}