{
  "backend/main.mo": "Motoko actor managing a persistent key-value map of labels, with functions to initialize defaults, add, rename, delete, and retrieve labels.",
  "feature_evidence.json": "Feature evidence report describing the image attachment feature added to RoutinesPage, listing affected files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and notable changes, serving as a build/change reference for the frontend codebase.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom property color tokens for light and dark themes, plus base body and border styles.",
  "frontend/index.html": "HTML entry point for MyOrganizer Pro PWA, loading two Google Fonts stylesheets covering 13 font families and referencing the React app entry script.",
  "frontend/public/manifest.json": "PWA web app manifest for MyOrganizer Pro defining app name, display mode, theme colors, and two icon sizes.",
  "frontend/public/sw.js": "Service worker implementing a cache-first with network fallback strategy for static assets, with cache versioning and notification click handling.",
  "frontend/src/App.tsx": "Root app component managing tab-based navigation across all pages, lazy-loading RoutinesPage, RecordsPage, and NotesPage with Suspense, and initializing settings and service worker on mount.",
  "frontend/src/components/common/LoadingSpinner.tsx": "Exports a spinning LoadingSpinner component and a PageSkeleton placeholder used as Suspense fallbacks during lazy page loads.",
  "frontend/src/components/common/Modal.tsx": "Reusable accessible modal dialog component with configurable size, scroll lock, Escape key dismissal, and focus management.",
  "frontend/src/components/common/ToastContainer.tsx": "Fixed-position toast notification container that renders success, error, and info toasts from the global toast store with dismiss buttons.",
  "frontend/src/components/home/QuoteWidget.tsx": "Home page widget displaying the current daily quote with custom font/color/alignment styling, navigating to the QuotePage on tap.",
  "frontend/src/components/home/StreakWidget.tsx": "A clickable home widget that displays the user's current check-in streak count, last check-in time, and a 'Today' badge if already checked in today.",
  "frontend/src/components/home/TodayRoutineWidget.tsx": "A clickable home widget that shows up to 4 items from today's routine profile (determined by day type), with formatted times and an overflow count.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component that composes the desktop sidebar, scrollable main content area, and mobile bottom tab bar into a full-screen shell.",
  "frontend/src/components/layout/AppSidebar.tsx": "Desktop-only sidebar with app logo, primary navigation buttons for all tabs, and a footer attribution link; hidden on mobile via Tailwind.",
  "frontend/src/components/layout/BottomTabBar.tsx": "Mobile-only fixed bottom navigation bar rendering icon+label tab buttons with active state indicators; hidden on desktop via Tailwind.",
  "frontend/src/components/notes/LabelManager.tsx": "Modal dialog for creating, renaming, and deleting note labels, including a confirmation overlay before deletion and bulk reassignment of affected notes.",
  "frontend/src/components/notes/MultiSelectToolbar.tsx": "Fixed top toolbar shown during multi-note selection that provides bulk archive, trash, and export (TXT/DOC/JSON) actions for the selected notes.",
  "frontend/src/components/notes/NoteCard.tsx": "Displays a single note as a card with support for custom colors, pinning, selection via long-press or checkbox, and a context menu for archive/trash actions.",
  "frontend/src/components/notes/NoteModal.tsx": "A modal component for creating and editing notes, supporting text, checklist, and image types with features like color picking, label selection, reminders, speech recognition, and export to doc.",
  "frontend/src/components/notes/QuickAddBar.tsx": "A collapsible bar component that lets users quickly create a new note by selecting between text, checklist, or image note types.",
  "frontend/src/components/streak/CheckInButton.tsx": "Displays the current streak count and a button to check in for the day, showing a confirmed state once the user has already checked in.",
  "frontend/src/components/streak/StreakCalendar.tsx": "Renders a monthly calendar view highlighting days the user checked in, with navigation controls to browse previous and next months.",
  "frontend/src/db/db.ts": "Instantiates and exports a singleton OrganizerDB class that exposes typed Table instances for all app data stores (notes, routines, records, streak, quotes, labels, imageBlobs, settings).",
  "frontend/src/db/idb.ts": "A lightweight native IndexedDB wrapper providing a Table class with add, put, get, delete, toArray, count, and clear operations, replacing Dexie.",
  "frontend/src/db/schema.ts": "Defines TypeScript interfaces for all database entities including Note, RoutineProfile, Record, StreakData, QuoteData, Label, ImageBlob, and AppSettings.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an Internet Computer actor using the current identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useImageStorage.ts": "A React hook providing saveImage, getImageUrl, and deleteImage callbacks for storing and retrieving image blobs in the IndexedDB imageBlobs table.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useLabels.ts": "Custom hook for CRUD operations on labels stored in IndexedDB, with duplicate/reserved-name guards and toast notifications.",
  "frontend/src/hooks/useNotes.ts": "Custom hook managing notes in IndexedDB with support for filtering by view/search/label, and operations including create, update, delete, trash, restore, and archive.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching all labels and initializing default labels via the backend actor.",
  "frontend/src/hooks/useQuote.ts": "Custom hook for loading, saving, and rotating motivational quotes stored in IndexedDB, supporting shuffle and daily rotation modes.",
  "frontend/src/hooks/useRecordImages.ts": "Utility module for storing, retrieving, and deleting compressed base64 record image attachments in localStorage, keyed by record ID.",
  "frontend/src/hooks/useRecords.ts": "Custom hook for managing records in IndexedDB with search and date-range filtering, and CRUD plus JSON export operations.",
  "frontend/src/hooks/useRoutineImages.ts": "Utility module for storing, retrieving, and deleting compressed base64 routine item image attachments in localStorage, keyed by routine item ID.",
  "frontend/src/hooks/useRoutines.ts": "Custom React hook for managing weekday/weekend routine profiles stored in IndexedDB via Dexie, providing CRUD operations (add, update, delete, reorder) and toggle-complete functionality for routine items.",
  "frontend/src/hooks/useScrollLock.ts": "Custom React hook that locks/unlocks body scroll by toggling CSS position/overflow styles and preserving the scroll position when the lock is released.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom React hook wrapping the Web Speech Recognition API to provide start/stop listening, final and interim transcript state, and error handling with browser compatibility detection.",
  "frontend/src/hooks/useStreak.ts": "Custom React hook that loads and manages a daily check-in streak from IndexedDB, incrementing or resetting the streak count based on consecutive day logic.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind base/components/utilities, and defines light/dark mode CSS custom properties (OKLCH color tokens) plus reusable component classes like note-card and masonry-grid.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and InternetIdentity providers wrapping the root App component.",
  "frontend/src/pages/HomePage.tsx": "Home page component displaying a live clock/date header, streak, quote, and today's routine widgets, plus a floating action button for quick note creation.",
  "frontend/src/pages/NotesPage.tsx": "Full-featured notes page supporting search, label filtering, multi-select bulk actions, note creation/editing via modal, and import/export of notes in TXT, DOC, and JSON formats.",
  "frontend/src/pages/QuotePage.tsx": "A settings/editor page for configuring a motivational quote widget, supporting font, color, alignment, blur, rotation mode, and a list of quotes with live preview and save functionality.",
  "frontend/src/pages/RecordsPage.tsx": "A full-featured records management page with add/edit/view/delete, search, date filtering, image attachments, speech recognition input, and import/export in TXT, DOC, and JSON formats.",
  "frontend/src/pages/RoutinesPage.tsx": "A routines management page with weekday/weekend/today tabs, drag-to-reorder, completion toggling, image attachments, speech recognition, and import/export support.",
  "frontend/src/pages/SettingsPage.tsx": "App settings page for toggling theme, accent color, font family, background image, storage usage display, and full data export/import/clear operations.",
  "frontend/src/pages/StreakPage.tsx": "Displays the user's daily check-in streak with current count, total check-ins, last check-in time, a check-in button, and a calendar history view.",
  "frontend/src/store/appStore.ts": "Zustand store managing global app appearance state (theme, accent color, font family) with apply functions that update CSS variables and localStorage.",
  "frontend/src/store/toastStore.ts": "Zustand store for managing a toast notification queue with auto-dismiss after 3.5 seconds and helper functions for success, error, and info toasts.",
  "frontend/src/utils/dataValidation.ts": "Validates imported JSON data by checking for required top-level arrays (notes, routines, records, labels) and returns a result with any errors found.",
  "frontend/src/utils/dateFormatter.ts": "Exports a `formatDateTime` utility that converts a string, number, or Date into a human-readable '28 Feb 2026, 3:45 AM' format, handling date-only strings and invalid input gracefully.",
  "frontend/src/utils/imageCompression.ts": "Provides `compressImage` and `generateThumbnail` functions that use a canvas to resize and JPEG-compress image files to specified max widths and quality levels.",
  "frontend/src/utils/noteExport.ts": "Exports notes (all or selected) to TXT, DOC, and JSON file formats by formatting note fields and triggering browser downloads.",
  "frontend/src/utils/noteImport.ts": "Parses and imports notes from JSON, TXT, and DOC files into the IndexedDB database, handling ID deduplication and field normalization.",
  "frontend/src/utils/notificationService.ts": "Provides helpers to request browser notification permission and schedule a one-shot `Notification` at a specified future timestamp using `setTimeout`.",
  "frontend/src/utils/recordExport.ts": "Exports an array of Record objects to TXT, DOC, or JSON files, formatting titles, timestamps, and content before triggering a browser download.",
  "frontend/src/utils/routineExport.ts": "Exports routine profiles and their items to TXT, DOC, or JSON files, with helpers for AM/PM time formatting and HTML escaping.",
  "frontend/src/utils/routineImport.ts": "Parses routine profiles from JSON or TXT files and imports them into the database, generating new IDs for items and normalizing fields.",
  "frontend/src/utils/seedData.ts": "Seeds the IndexedDB database with initial sample data for notes, records, streaks, quotes, and routines if each table is empty on first load.",
  "frontend/src/utils/serviceWorkerRegistration.ts": "Registers the app's service worker (/sw.js) on page load if the browser supports it, silently ignoring failures.",
  "frontend/src/utils/storage.ts": "Provides localStorage get/set helpers for small UI settings: theme, accent color, and font family.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, OKLCH-based color tokens, border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, existing features, and pending feature requests; currently records one completed image-attachment feature for routines and one pending AR-1 request to add a gallery image upload option alongside camera capture."
}