{
  "backend/main.mo": "Minimal Motoko actor exposing a single `ping` query function that returns 'pong'.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (formatDateTime utility, date display replacements, gold accent color presets) to their source files, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON object containing short summaries of three frontend files: App.tsx, NotesPage.tsx, and index.css.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens (colors, radius, sidebar) for both light and dark modes.",
  "frontend/index.html": "HTML entry point for the React app, configuring PWA meta tags, Google Fonts imports, and mounting the root div with the Vite module script.",
  "frontend/public/manifest.json": "PWA web app manifest for MyOrganizer Pro, defining app name, icons, display mode, and theme colors.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy for static assets, with install/activate lifecycle management and notification click handling.",
  "frontend/src/App.tsx": "Root React component managing tab-based navigation across all app pages, initializing settings and seed data on mount, and registering the service worker.",
  "frontend/src/components/common/LoadingSpinner.tsx": "Reusable loading spinner component with three size variants and a PageSkeleton placeholder for full-page loading states.",
  "frontend/src/components/common/Modal.tsx": "Accessible modal dialog component supporting multiple sizes, keyboard (Escape) dismissal, scroll lock, and focus management.",
  "frontend/src/components/common/ToastContainer.tsx": "Toast notification container that renders success, error, and info toasts from the toast store with dismiss buttons.",
  "frontend/src/components/home/QuoteWidget.tsx": "Home page widget displaying the current daily quote with custom font/color/alignment styling and a navigation button to the quotes page.",
  "frontend/src/components/home/StreakWidget.tsx": "Home page widget showing the current streak count, last check-in time formatted with date-fns, and a today-checked indicator.",
  "frontend/src/components/home/TodayRoutineWidget.tsx": "Home page widget displaying up to four items from today's routine profile with formatted times and a link to the routines page.",
  "frontend/src/components/layout/AppHeader.tsx": "Sticky application header displaying the current page title with a Sparkles icon and a settings shortcut button that navigates to the settings tab.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout shell that composes the header, a desktop sidebar, a scrollable main content area, and a mobile-only fixed bottom tab bar.",
  "frontend/src/components/layout/AppSidebar.tsx": "Desktop sidebar navigation rendering icon+label buttons for all app tabs, with the active item highlighted via accent CSS variables and a left border indicator.",
  "frontend/src/components/layout/BottomTabBar.tsx": "Mobile bottom navigation bar with five primary tabs (Home, Notes, Records, Routines, Streak), highlighting the active tab with the accent color and a bottom indicator bar.",
  "frontend/src/components/notes/LabelManager.tsx": "Modal component for creating, renaming, and deleting note labels, with color selection from a preset palette and an inline edit mode per label.",
  "frontend/src/components/notes/MultiSelectToolbar.tsx": "Fixed top toolbar shown during multi-note selection, displaying the selected count and action buttons to archive, trash, or clear the selection.",
  "frontend/src/components/notes/NoteCard.tsx": "Card component for displaying a single note in a grid/list, supporting long-press selection, pin/archive/trash actions, color backgrounds, and previews for text, checklist, and image note types.",
  "frontend/src/components/notes/NoteModal.tsx": "Full-screen modal for viewing and editing a note, supporting title, text content, checklist items, color picker, label assignment, reminders, and image upload with compression.",
  "frontend/src/components/notes/QuickAddBar.tsx": "Collapsed input bar that expands to let users choose a note type (text, checklist, or image) to quickly create a new note.",
  "frontend/src/components/streak/CheckInButton.tsx": "Renders a daily check-in button showing the current streak count with a flame icon, switching to a green 'Checked In' state with a checkmark once the user has checked in.",
  "frontend/src/components/streak/StreakCalendar.tsx": "Displays a navigable monthly calendar that highlights days the user checked in, using timestamps from a history array, with today's date outlined distinctly.",
  "frontend/src/db/db.ts": "Instantiates and exports a singleton OrganizerDB class that exposes typed Table instances for all app data stores (notes, routines, records, streak, quotes, labels, imageBlobs, settings) and a clearAll utility.",
  "frontend/src/db/idb.ts": "Lightweight native IndexedDB wrapper providing a Table class with add, put, get, delete, toArray, count, and clear methods, plus a clearAllStores helper, replacing Dexie.",
  "frontend/src/db/schema.ts": "Defines TypeScript interfaces for all IndexedDB data models: Note, RoutineProfile, Record, StreakData, QuoteData, Label, ImageBlob, and AppSettings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor via React Query, using the current Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useImageStorage.ts": "Custom hook providing saveImage, getImageUrl, and deleteImage callbacks that persist and retrieve image Blobs keyed by string in the IndexedDB imageBlobs store.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login/logout state, persisting identity across page reloads with idle handling disabled by default.",
  "frontend/src/hooks/useLabels.ts": "Custom hook that loads, creates, updates, and deletes Label records in IndexedDB, maintaining local state and showing success/error toasts on each operation.",
  "frontend/src/hooks/useNotes.ts": "Custom hook managing notes CRUD operations against IndexedDB with support for filtering by view (all/archive/trash), search query, and label, plus pinned-first sorting and multi-select state.",
  "frontend/src/hooks/useQueries.ts": "Provides a `usePing` hook that queries the backend actor's ping endpoint using React Query, returning 'offline' if unavailable.",
  "frontend/src/hooks/useQuote.ts": "Custom hook for loading, saving, and rotating motivational quotes stored in IndexedDB, supporting shuffle and daily rotation modes.",
  "frontend/src/hooks/useRecords.ts": "Custom hook for managing journal/log records in IndexedDB with support for CRUD operations, search filtering, date range filtering, and JSON export.",
  "frontend/src/hooks/useRoutines.ts": "Custom hook managing weekday and weekend routine profiles in IndexedDB, supporting item add/update/delete/reorder and completion toggling.",
  "frontend/src/hooks/useScrollLock.ts": "Hook that locks and unlocks body scroll by toggling CSS position/overflow styles, preserving scroll position when unlocked.",
  "frontend/src/hooks/useStreak.ts": "Custom hook for managing a daily check-in streak stored in IndexedDB, handling streak counting, break detection, and history tracking.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/components/utilities, OKLCH-based CSS design tokens for light and dark themes, and utility classes for layout and note cards.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query, Internet Identity, and the root App component.",
  "frontend/src/pages/HomePage.tsx": "Dashboard home page displaying a streak banner, quick stats grid, recent notes, todos, and a random quote, with navigation callbacks to other tabs.",
  "frontend/src/pages/NotesPage.tsx": "Main notes page component supporting create, edit, archive, trash, multi-select bulk actions, label filtering, search, and view tabs (Notes/Archive/Trash). Integrates QuickAddBar, NoteCard, NoteModal, MultiSelectToolbar, and LabelManager components.",
  "frontend/src/pages/QuotePage.tsx": "Quotes collection page allowing users to add, edit, delete, and favorite quotes, with a randomly shuffled featured quote display and filter between all/favorites.",
  "frontend/src/pages/RecordsPage.tsx": "Personal records tracking page with add/edit/delete functionality, category filtering across predefined categories, and CSV export of all records.",
  "frontend/src/pages/RoutinesPage.tsx": "Daily routines management page supporting add/edit/delete routines with day-of-week scheduling, today/all view toggle, and per-routine habit logging with toast feedback.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page for toggling dark/light mode, selecting accent color from gold and other presets, adjusting font size, and exporting/importing/clearing all app data.",
  "frontend/src/pages/StreakPage.tsx": "React page displaying the user's daily streak with an SVG progress ring, check-in button, stats grid (current/longest/total), and a scrollable check-in history list, all formatted using the shared formatDateTime utility.",
  "frontend/src/store/appStore.ts": "Zustand store managing global UI settings (dark mode, accent color, font size, background image), persisting them to localStorage and applying corresponding CSS custom properties to the document root.",
  "frontend/src/store/dataStore.ts": "Zustand store providing full CRUD operations for notes, records, routines, habit logs, streaks, quotes, todos, and labels, with all data persisted to localStorage as ISO-string-timestamped entries.",
  "frontend/src/store/toastStore.ts": "Zustand store managing a timed toast notification queue with success/error/info variants, auto-removing toasts after 3.5 seconds, and exposing convenience helper functions.",
  "frontend/src/utils/dataValidation.ts": "Validates imported JSON data by checking for required top-level arrays (notes, routines, records, labels) and returns a result object listing any validation errors.",
  "frontend/src/utils/formatDateTime.ts": "Utility function that formats dates from various input types (ISO string, timestamp, Date object) into a human-readable 'DD MMM YYYY, h:mm AM/PM' string with graceful fallbacks for invalid input.",
  "frontend/src/utils/imageCompression.ts": "Provides two async functions to compress images via an HTML canvas: compressImage resizes to a max width at configurable JPEG quality, and generateThumbnail creates a small 300px-wide preview.",
  "frontend/src/utils/notificationService.ts": "Utility for requesting browser notification permission and scheduling a one-shot native Notification via setTimeout at a specified future timestamp.",
  "frontend/src/utils/seedData.ts": "Seeds the Dexie database with default notes, a record entry, streak state, a quote with a preset list, and weekday/weekend routine profiles if the respective tables are empty.",
  "frontend/src/utils/serviceWorkerRegistration.ts": "Registers the app's service worker (/sw.js) on page load, silently ignoring failures so the app continues to function without it.",
  "frontend/src/utils/storage.ts": "Thin localStorage helpers restricted to small UI settings (theme, accent color, font family), each with a typed getter and setter using namespaced keys.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts, oklch-based color tokens, border radii, box shadows, and keyframe animations, while enabling dark mode via class and including typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current state of the personal organizer web app project, including versioning, architectural notes, known issues, and a detailed list of existing and planned features covering formatting, theming, and UI consistency requirements."
}