{
  "backend/main.mo": "Motoko actor that manages a persistent key-value map of labels, exposing functions to initialize defaults, add, rename, delete, and query labels.",
  "feature_evidence.json": "Feature evidence report listing implemented features for the Records section, including client-side export (TXT/DOC/JSON), image attachment with compression, and speech-to-text input, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, serving as a build planning reference for the project's frontend codebase.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark color themes, applied globally to base elements.",
  "frontend/index.html": "HTML entry point for MyOrganizer Pro PWA, loading two Google Fonts stylesheet links (covering Inter, Poppins, Roboto, Montserrat, and others) and the React app root script.",
  "frontend/public/manifest.json": "PWA web app manifest for MyOrganizer Pro, defining app name, display mode, theme colors, and two icon sizes for installation.",
  "frontend/public/sw.js": "Service worker implementing a cache-first with network fallback strategy for same-origin GET requests, with cache versioning and notification click handling.",
  "frontend/src/App.tsx": "Root React component managing tab-based navigation, lazy-loading Notes and Records pages, initializing app settings and seeding the database on mount, and rendering the AppLayout with a global ToastContainer.",
  "frontend/src/components/common/LoadingSpinner.tsx": "Exports a spinning LoadingSpinner component in three sizes and a PageSkeleton placeholder used as a Suspense fallback.",
  "frontend/src/components/common/Modal.tsx": "Accessible modal dialog component with scroll lock, Escape key handling, focus management, configurable sizes, and an optional title/close button header.",
  "frontend/src/components/common/ToastContainer.tsx": "Fixed-position toast notification container that renders success, error, and info toasts from the toast store with dismiss buttons and ARIA live region support.",
  "frontend/src/components/home/QuoteWidget.tsx": "A clickable home widget that displays the user's daily quote (text, author, and styling) using the useQuote hook, with a navigation callback on click.",
  "frontend/src/components/home/StreakWidget.tsx": "A clickable home widget showing the user's current check-in streak count, last check-in time, and a today indicator using the useStreak hook.",
  "frontend/src/components/home/TodayRoutineWidget.tsx": "A clickable home widget that previews up to 4 items from today's routine profile (determined by day type) using the useRoutines hook.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component that composes the desktop AppSidebar, main content area, and mobile BottomTabBar with active tab state.",
  "frontend/src/components/layout/AppSidebar.tsx": "Desktop-only sidebar with logo, navigation buttons for all main tabs, and a footer attribution link; hidden on mobile via Tailwind.",
  "frontend/src/components/layout/BottomTabBar.tsx": "Mobile-only fixed bottom navigation bar rendering tab buttons with active indicators; hidden on desktop via Tailwind.",
  "frontend/src/components/notes/LabelManager.tsx": "Modal dialog for creating, renaming, and deleting note labels, including a confirmation overlay for destructive deletes and bulk label reassignment on deletion.",
  "frontend/src/components/notes/MultiSelectToolbar.tsx": "Fixed top toolbar shown during multi-note selection, providing archive, trash, and export (TXT/DOC/JSON) actions for the selected notes.",
  "frontend/src/components/notes/NoteCard.tsx": "Grid card component for a single note that supports long-press selection, pin/archive/trash context actions, and renders text, checklist, or image note types with optional custom background color.",
  "frontend/src/components/notes/NoteModal.tsx": "A modal component for creating and editing notes that supports text, checklist, and image note types with features including color picking, label selection, reminders, speech recognition input, and export to document.",
  "frontend/src/components/notes/QuickAddBar.tsx": "A collapsible bar component that lets users quickly create a new note by selecting from text, checklist, or image note types.",
  "frontend/src/components/streak/CheckInButton.tsx": "Displays the current streak count and a button to check in for the day, showing a disabled confirmed state once the user has already checked in.",
  "frontend/src/components/streak/StreakCalendar.tsx": "Renders a monthly calendar view highlighting days the user has checked in, with navigation controls to move between months.",
  "frontend/src/db/db.ts": "Instantiates and exports a singleton OrganizerDB object that exposes typed Table instances for all app data stores (notes, routines, records, streak, quotes, labels, imageBlobs, settings).",
  "frontend/src/db/idb.ts": "A lightweight native IndexedDB wrapper that provides a generic Table class with add, put, get, delete, toArray, count, and clear operations, replacing a Dexie dependency.",
  "frontend/src/db/schema.ts": "Defines TypeScript interfaces for all database entities used in the app, including Note, RoutineProfile, Record, StreakData, QuoteData, Label, ImageBlob, and AppSettings.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an Internet Computer actor using the current identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useImageStorage.ts": "A React hook providing saveImage, getImageUrl, and deleteImage callbacks that persist and retrieve image blobs in the IndexedDB imageBlobs store.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useLabels.ts": "Custom hook for managing labels in IndexedDB, providing CRUD operations (create, update, delete) with duplicate/reserved-name guards and toast notifications.",
  "frontend/src/hooks/useNotes.ts": "Custom hook for managing notes in IndexedDB, supporting create/update/delete/trash/archive/restore operations, filtering by view, search, and label, and multi-selection.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching all labels and initializing default labels via the backend actor, with IndexedDB used for all other data.",
  "frontend/src/hooks/useQuote.ts": "Custom hook for managing a motivational quote in IndexedDB, supporting save and rotation (shuffle or daily) from a quote list.",
  "frontend/src/hooks/useRecordImages.ts": "Utility module for storing, retrieving, and deleting compressed base64 record image attachments in localStorage, keyed by record ID.",
  "frontend/src/hooks/useRecords.ts": "Custom hook for managing records in IndexedDB, supporting add/update/delete/export operations and filtering by search text and date range.",
  "frontend/src/hooks/useRoutines.ts": "Custom React hook for managing weekday/weekend routine profiles stored in IndexedDB via Dexie, providing CRUD operations (add, update, delete, reorder) and toggle-complete functionality with toast notifications.",
  "frontend/src/hooks/useScrollLock.ts": "Custom React hook that locks/unlocks body scroll by toggling CSS position fixed and preserving the scroll position so it can be restored on unlock.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom React hook wrapping the Web Speech Recognition API to provide start/stop listening, final and interim transcript state, error handling, and a reset utility.",
  "frontend/src/hooks/useStreak.ts": "Custom React hook that loads and persists a daily check-in streak from IndexedDB, incrementing or resetting the count based on whether the last check-in was yesterday, and showing appropriate toast messages.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind base/components/utilities, and defines light/dark mode CSS custom properties (oklch color tokens) plus reusable component classes like note-card and masonry-grid.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and an Internet Identity provider wrapping the root App component.",
  "frontend/src/pages/HomePage.tsx": "Home page component displaying a live clock/date header, streak, quote, and today's routine widgets, plus a floating action button for quick note creation.",
  "frontend/src/pages/NotesPage.tsx": "Full-featured notes page supporting search, label filtering, multi-select bulk actions, note creation/editing via modal, and import/export of notes in TXT, DOC, and JSON formats.",
  "frontend/src/pages/QuotePage.tsx": "A settings/editor page for configuring a motivational quote widget, supporting font, color, alignment, blur, rotation mode, and a managed list of quotes with a live preview.",
  "frontend/src/pages/RecordsPage.tsx": "A journal-style records page with search, date filtering, CRUD operations, image attachments, speech-to-text input, and multi-format export (txt, doc, json).",
  "frontend/src/pages/RoutinesPage.tsx": "A daily routines management page with weekday/weekend profiles, drag-to-reorder, completion toggling, speech-to-text for titles, and import/export in multiple formats.",
  "frontend/src/pages/SettingsPage.tsx": "App settings page for toggling theme, accent color, font family, background image, storage usage display, and full data export/import with confirmation flow.",
  "frontend/src/pages/StreakPage.tsx": "Displays the user's daily check-in streak with current count, total check-ins, last check-in time, a check-in button, and a calendar history view.",
  "frontend/src/store/appStore.ts": "Zustand store managing global app appearance state (theme, accent color, font family) with helpers to persist and apply CSS variable changes to the document.",
  "frontend/src/store/toastStore.ts": "Zustand store for managing a queue of auto-dismissing toast notifications, with convenience functions for success, error, and info toasts.",
  "frontend/src/utils/dataValidation.ts": "Validates the structure of imported JSON data, checking that required top-level arrays (notes, routines, records, labels) are present.",
  "frontend/src/utils/dateFormatter.ts": "Exports a `formatDateTime` utility that converts strings, numbers, or Date objects into a human-readable '28 Feb 2026, 3:45 AM' format, returning an empty string on invalid input.",
  "frontend/src/utils/imageCompression.ts": "Provides `compressImage` and `generateThumbnail` functions that use a canvas to resize and JPEG-compress image files to specified max widths and quality levels.",
  "frontend/src/utils/noteExport.ts": "Exports notes (all or selected) to TXT, DOC, and JSON formats by formatting Note objects and triggering browser file downloads.",
  "frontend/src/utils/noteImport.ts": "Parses JSON, TXT, and DOC files into Note objects and saves them to the IndexedDB database, handling ID deduplication against existing notes.",
  "frontend/src/utils/notificationService.ts": "Provides helpers to request browser notification permission and schedule a delayed browser notification at a specified timestamp.",
  "frontend/src/utils/recordExport.ts": "Exports an array of Record objects to TXT, DOC, or JSON files via browser download, formatting titles, timestamps, and content for each record.",
  "frontend/src/utils/routineExport.ts": "Exports RoutineProfile data (all or selected) to TXT, DOC, and JSON formats, formatting profile types and routine items with time, tag, icon, and duration fields.",
  "frontend/src/utils/routineImport.ts": "Parses JSON, TXT, and DOC files into RoutineProfile objects and upserts them into the IndexedDB database, with fallback handling for unrecognized formats.",
  "frontend/src/utils/seedData.ts": "Seeds the IndexedDB database with initial sample data for notes, records, streaks, quotes, and routines if each collection is empty on first run.",
  "frontend/src/utils/serviceWorkerRegistration.ts": "Registers the app's service worker (/sw.js) on page load if the browser supports it, silently ignoring registration failures.",
  "frontend/src/utils/storage.ts": "Provides typed localStorage get/set helpers for small UI settings: theme (light/dark), accent color, and font family.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom font families, OKLCH-based semantic color tokens, border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current project state including version, architectural constraints, and a list of existing features being added to the Records section (export formats, image attachment, and speech-to-text input)."
}