{
  "kind": "build_request",
  "title": "Add Speech-to-Text Mic Input and DOC Export to Notes",
  "projectName": "MyOrganizer Pro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a Mic button inside the NoteModal component (frontend/src/components/notes/NoteModal.tsx) in the note body (and title) input area. When tapped, use the browser's built-in Web Speech API (SpeechRecognition / webkitSpeechRecognition) to start live speech-to-text transcription. Transcribed text must be inserted/appended at the current cursor position in whichever field (title or body) is active. Provide stop/pause and resume controls. If SpeechRecognition is not supported, show an inline message: 'Speech-to-text not supported on this browser.' Do not store any raw audio — only the resulting text is saved. Transcription must not disrupt normal keyboard typing/editing, and the note must continue to save normally via the existing save flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add a 'Mic' (audio input) option ONLY inside the Notes add/edit flow (where the note text is entered).",
          "Start speech-to-text using the browser's built-in Web Speech API (SpeechRecognition / webkitSpeechRecognition).",
          "Transcribe speech live and insert/append into the note body (and/or title if cursor is there).",
          "Allow stop/pause and resume.",
          "If SpeechRecognition is not supported, show a simple inline message: 'Speech-to-text not supported on this browser.'",
          "Do NOT store raw audio. Only store the resulting text in the note."
        ]
      },
      "acceptanceCriteria": [
        "A Mic button appears in the note body/title area of the NoteModal without altering any other existing UI elements.",
        "Tapping Mic starts live transcription using SpeechRecognition / webkitSpeechRecognition.",
        "Transcribed text is appended/inserted into the active input field (title or body) in real time.",
        "Stop/pause and resume controls are available while recording.",
        "On browsers without SpeechRecognition support, the inline message 'Speech-to-text not supported on this browser.' is displayed instead of the Mic button or on tap.",
        "No raw audio is persisted; only text is stored via the existing note save mechanism.",
        "Normal keyboard typing still works during and after transcription, and the note saves successfully."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a client-side 'Export as Document' option for individual notes. This must appear as a minimal addition in the existing note actions area (e.g., NoteModal or NoteCard context menu — whichever already has export/action options) without changing any existing controls. The export must generate a .DOC file (Word-compatible HTML document). Optionally also offer .PDF export if it can be done fully client-side without a server or external library that is complex to integrate; otherwise skip PDF and only provide DOC. The exported document must include: the note title, the note body with line breaks preserved, labels/tags displayed as a small line below the title, and the created/updated date-time formatted using the same format used elsewhere in the app (per frontend/src/utils/dateFormatter.ts, e.g. '28 Feb 2026, 3:45 AM'). The filename format must be: NoteTitle_YYYY-MM-DD_HHMM.doc (or .pdf). Export must work entirely client-side with no server calls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "In the existing Export area or within Notes actions (use whichever is already present), add: A) Export selected note as .DOC (Word-compatible HTML doc) OR .DOCX if available B) Export selected note as .PDF (optional if easy; if not, skip PDF and keep DOC)",
          "Export must include: Note title, Note body (preserve line breaks), Labels/tags (as a small line under title), Created/Updated date-time (use the same date+time format used elsewhere in the app)",
          "File name format: NoteTitle_YYYY-MM-DD_HHMM.doc (or docx/pdf)",
          "Export must work fully client-side (no server)."
        ]
      },
      "acceptanceCriteria": [
        "An 'Export as Document' option is added to the existing note actions area (NoteModal or NoteCard context menu) without removing or relocating any existing controls.",
        "Clicking the option triggers a client-side download of a .DOC (HTML-based Word-compatible) file.",
        "The exported file contains: note title, note body with line breaks preserved, labels/tags on a small line beneath the title, and created/updated date-time in the app's standard format.",
        "The downloaded filename follows the pattern NoteTitle_YYYY-MM-DD_HHMM.doc.",
        "No server request is made during export; the file is generated and downloaded entirely in the browser.",
        "Existing export functionality (if any) is unaffected."
      ]
    }
  ],
  "constraints": [
    "Do NOT change any existing UI layout, styling, feature behavior, or component structure outside of the two new additions.",
    "Do NOT alter existing data structures in the DB schema unless strictly required; any such change must be fully backward-compatible.",
    "Do NOT modify any file listed in frontend.immutablePaths.",
    "Mic button and Export as Document option must visually match the current design system (same colors, typography, spacing).",
    "No raw audio may be stored anywhere.",
    "All new functionality must be purely client-side with no backend or server calls."
  ],
  "nonGoals": [
    "PDF export is optional; do not implement it if it requires a non-trivial external library or server-side processing.",
    "No changes to the backend (main.mo) are required.",
    "No changes to routing, navigation, or any page other than Notes-related components.",
    "No new labels, data fields, or DB tables unless strictly required for backward-compatible note text storage.",
    "No changes to existing export features (e.g., JSON export in RecordsPage or SettingsPage).",
    "No real-time collaboration, cloud sync, or server-side transcription."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}