{
  "kind": "build_request",
  "title": "Add image upload and camera capture to Routine section",
  "projectName": "MyOrganizer Pro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Routines page (RoutinesPage.tsx), add an image attachment feature to routine items. Each routine item should support attaching an image via two input options: (1) gallery/file upload (accept=\"image/*\") and (2) camera capture (accept=\"image/*\" capture=\"environment\"). Display a thumbnail preview of the attached image on the routine item card. Store the image using the existing useImageStorage hook (IndexedDB imageBlobs table). Do not modify any existing routine item fields, drag-to-reorder, add/edit/delete, speech recognition, import/export, or tab-switching functionality.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "In routine section add give image upload along with camera pic upload",
          "Note don't change anything in existing"
        ]
      },
      "acceptanceCriteria": [
        "Routine item add/edit modal or inline UI shows two distinct buttons/options: one for gallery upload and one for camera capture.",
        "Gallery upload uses an <input type=\"file\" accept=\"image/*\"> element.",
        "Camera capture uses an <input type=\"file\" accept=\"image/*\" capture=\"environment\"> element.",
        "Selected image is compressed (using existing compressImage utility) and saved to IndexedDB via useImageStorage.",
        "A thumbnail preview of the attached image is visible on the routine item card after saving.",
        "The attached image can be removed/replaced.",
        "All existing routine features (drag-to-reorder, time/icon fields, speech recognition, import/export, weekday/weekend/today tabs, complete toggle) remain fully functional and unchanged.",
        "No backend changes are made."
      ]
    }
  ],
  "constraints": [
    "Do not change any existing routine item fields, drag-to-reorder logic, tab navigation, speech recognition, import/export, or any other existing functionality in RoutinesPage.tsx or useRoutines.ts.",
    "Use the existing useImageStorage hook for storing and retrieving images.",
    "Use the existing compressImage utility from imageCompression.ts for compressing uploaded images.",
    "Do not modify any immutable frontend paths."
  ],
  "nonGoals": [
    "Adding image upload to Notes or Records pages (already exists).",
    "Changing the backend schema or Motoko actor.",
    "Modifying any existing UI layout beyond adding the image upload controls."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}