{
  "kind": "build_request",
  "title": "Add Routines Export Formats (TXT/WORD/JSON) and Mic Speech-to-Text in Routine Add/Edit",
  "projectName": "MyOrganizer Pro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Routines Import/Export area (wherever routine export currently exists in RoutinesPage.tsx or related components), add three export format options — TXT, WORD (DOC as Word-compatible HTML), and JSON — using the smallest possible UI addition (e.g., a format selector or additional buttons) that matches the existing design style. Do not remove or change any existing export behavior; only add these new format options alongside what already exists.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "add export format options: TXT, WORD (DOC or DOCX; if DOCX is not feasible client-side, use DOC as Word-compatible HTML), JSON",
          "Do not remove or change existing export behavior; only add these formats/options."
        ]
      },
      "acceptanceCriteria": [
        "TXT, WORD (DOC), and JSON export options are visible in the existing Routines export area.",
        "Existing export behavior is unchanged; new formats are additive only.",
        "The UI addition is minimal and matches the current design style."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Each routine export (TXT, WORD/DOC, JSON) must include for every routine item: the Profile (Weekdays / Weekends / Auto as applicable), the time formatted in AM/PM, the title, and any other fields the app already stores per item (description, tag, duration, etc.). The exported file must be named routines_YYYY-MM-DD_HHMM.(txt|doc|json) using the current local date and time. Export must be entirely client-side and work offline, using only browser APIs (no server calls). Implement or update frontend/src/utils/routineExport.ts accordingly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Export must include for each routine item: Profile (Weekdays/Weekends/Auto if applicable), Time in AM/PM, Title (and any description/tag/duration if the app already has them)",
          "File naming: routines_YYYY-MM-DD_HHMM.(txt/doc/json)",
          "Export must be client-side only and work offline."
        ]
      },
      "acceptanceCriteria": [
        "Exported TXT file contains profile, AM/PM time, title, and any other stored fields for each item.",
        "Exported DOC file (Word-compatible HTML) contains the same fields and opens in Word.",
        "Exported JSON file contains the same fields in structured JSON.",
        "Downloaded file is named routines_YYYY-MM-DD_HHMM with the appropriate extension.",
        "Export works fully offline without any network requests."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Inside the Routine Add/Edit modal or form (in RoutinesPage.tsx or the relevant add/edit component), add a small Mic button next to the routine title or notes input field. When clicked, it uses the browser Web Speech API (SpeechRecognition / webkitSpeechRecognition) to start speech recognition, shows live interim transcription, and appends/inserts the final transcribed text into the active input field (title or notes). A second click (or a Stop button) ends recognition. Do not store audio — only the resulting text string. This addition must not interfere with manual typing or the save/submit flow. Use the existing useSpeechRecognition hook (frontend/src/hooks/useSpeechRecognition.ts) if it is compatible, or extend it minimally.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Add a Mic (speech-to-text) option ONLY inside the Routine Add/Edit flow in the Routines tab/section.",
          "Use browser Web Speech API (SpeechRecognition / webkitSpeechRecognition): Start/stop, Live transcription, Insert/append transcribed text into the routine title/notes field being edited",
          "Do NOT store audio, only the resulting text.",
          "Must not break manual typing or saving."
        ]
      },
      "acceptanceCriteria": [
        "A Mic button appears only inside the Routine Add/Edit form, next to the title or notes input.",
        "Clicking the Mic button starts speech recognition; live interim results are shown.",
        "Clicking Stop (or the Mic button again) ends recognition and appends the final transcript to the input field.",
        "Manual typing continues to work normally before, during, and after recognition.",
        "The save/submit flow is unaffected.",
        "No audio data is stored; only the text transcript is inserted into the field."
      ]
    },
    {
      "id": "REQ-4",
      "text": "If the browser does not support SpeechRecognition or webkitSpeechRecognition, display a small inline message reading 'Speech-to-text not supported on this browser.' in place of or next to the Mic button inside the Routine Add/Edit form. No Mic button should appear in this case.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "If not supported, show a small inline message: 'Speech-to-text not supported on this browser.'"
        ]
      },
      "acceptanceCriteria": [
        "On browsers without SpeechRecognition support, the Mic button is not rendered.",
        "Instead, the message 'Speech-to-text not supported on this browser.' is shown inline in the Routine Add/Edit form.",
        "The rest of the form functions normally on unsupported browsers."
      ]
    }
  ],
  "constraints": [
    "Do not modify any UI layout, styling, feature behavior, or naming outside the described additions.",
    "Do not remove or alter any existing export functionality for routines or notes.",
    "Speech-to-text must only appear inside the Routine Add/Edit flow — not on any other page or component.",
    "All export logic must be client-side only; no backend changes required.",
    "Do not edit files listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Adding export format options to Notes or Records pages.",
    "Adding speech-to-text to any form outside of Routine Add/Edit.",
    "Storing or uploading audio recordings.",
    "Changing the visual design, color scheme, typography, or layout of any existing component.",
    "Adding DOCX export (use DOC as Word-compatible HTML instead).",
    "Any backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}