{
  "kind": "build_request",
  "title": "Make note labels/tags configurable (add, rename, delete with persistence)",
  "projectName": "MyOrganizer Pro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the backend (or existing storage layer) to persist user-defined labels. On first run, initialize with the default set: All, Welcome, Work, Personal, Ideas. The 'All' label must always exist and cannot be renamed or deleted.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Save the user's custom labels/tags using the same storage method the app already uses for settings/data",
          "On first run, initialize labels as: All, Welcome, Work, Personal, Ideas (same as current)"
        ]
      },
      "acceptanceCriteria": [
        "Labels are persisted using the existing IndexedDB labels table (OrganizerDB)",
        "On first run (empty labels table), the five default labels — All, Welcome, Work, Personal, Ideas — are seeded",
        "The 'All' label always exists after initialization and cannot be modified or removed"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the useLabels hook to expose createLabel, updateLabel (except for 'All'), and deleteLabel (except for 'All') operations. When a label is deleted, all notes that reference that label must be safely reassigned to 'All' (or have the label reference removed) without breaking any existing note data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Allow user to add new labels/tags.",
          "Allow user to rename existing labels/tags (except 'All').",
          "Allow user to delete labels/tags (except 'All').",
          "If a label is deleted, notes using that label should be reassigned to 'All'"
        ]
      },
      "acceptanceCriteria": [
        "createLabel adds a new label to IndexedDB and updates the UI label list",
        "updateLabel renames an existing label in IndexedDB; calling it on 'All' is a no-op or blocked",
        "deleteLabel removes a label from IndexedDB; calling it on 'All' is a no-op or blocked",
        "After deleteLabel, all notes previously assigned that label are updated so their label field is set to 'All' (or equivalent safe default)",
        "No note data is lost or corrupted when a label is deleted"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Expose label management UI through the existing LabelManager modal component (frontend/src/components/notes/LabelManager.tsx) so users can add new labels, rename existing labels (except 'All'), and delete existing labels (except 'All'). Do not change the Notes page layout, label filter bar appearance, or any other UI outside of what is strictly required for this management interface.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Do not change the Notes UI layout. Only make these label/tag options configurable by the user.",
          "Allow user to add new labels/tags.",
          "Allow user to rename existing labels/tags (except 'All').",
          "Allow user to delete labels/tags (except 'All')."
        ]
      },
      "acceptanceCriteria": [
        "The LabelManager modal allows adding a new label by entering a name and confirming",
        "The LabelManager modal allows renaming any label except 'All' inline",
        "The LabelManager modal allows deleting any label except 'All', with a confirmation step",
        "'All' label has no rename or delete controls visible",
        "No changes are made to the Notes page layout, label filter bar, note cards, or any other UI outside the LabelManager modal"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the label filter bar in NotesPage continues to read labels dynamically from the persisted labels list (via useLabels or equivalent), so newly added, renamed, or deleted labels are immediately reflected in the filter options without any page reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Filtering by a label/tag must continue to work exactly as it does now."
        ]
      },
      "acceptanceCriteria": [
        "After adding a new label, it appears in the filter bar on the Notes page",
        "After renaming a label, the updated name appears in the filter bar",
        "After deleting a label, it is removed from the filter bar",
        "Selecting any label in the filter bar correctly filters notes to those assigned that label, same as current behavior",
        "'All' always appears as the first filter option"
      ]
    }
  ],
  "constraints": [
    "Do not change the Notes page UI layout, label filter bar appearance, styling, or any other existing UI or feature outside of label management",
    "Do not introduce any new storage systems; use the existing IndexedDB labels table already present in OrganizerDB",
    "The 'All' label must always exist, must be the first option, and must never be renameable or deletable",
    "Do not rename, restyle, or restructure any existing components, pages, or hooks beyond what is strictly required for this feature",
    "Immutable frontend paths must not be modified"
  ],
  "nonGoals": [
    "Changing the visual design, colors, or layout of the Notes page or any other page",
    "Adding label colors or icons (unless already present in LabelManager)",
    "Any changes to note creation, editing, archiving, trashing, or other note features",
    "Any changes outside the Notes section and its label management"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}