{
  "kind": "build_request",
  "title": "Fix: Labels instant update and Trash permanent delete",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When a label is added or renamed via the LabelManager modal, the Notes filter bar must update immediately without requiring a page refresh. The internal labels state used by NotesPage must be refreshed synchronously after the add/rename operation completes in IndexedDB. If the renamed label is currently selected as the active filter, keep it selected and update its displayed name in place. A newly added label must appear in the filter bar immediately.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "When the user adds a new label or renames an existing label, the Notes filter bar must update immediately (no page refresh, no reload required).",
          "If the renamed label was currently selected, keep it selected and update its displayed name instantly.",
          "Make sure both the UI state and stored data are updated in the same action so they never get out of sync."
        ]
      },
      "acceptanceCriteria": [
        "Adding a label via LabelManager causes it to appear in the Notes filter bar without any page refresh.",
        "Renaming a label via LabelManager updates the label name in the Notes filter bar without any page refresh.",
        "If the active filter label was renamed, it remains selected and shows the new name immediately.",
        "The updated labels are persisted in IndexedDB (same storage method already used) and survive a page refresh.",
        "UI state and IndexedDB state are always in sync after add or rename."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the Trash view of NotesPage, 'Delete permanently' must immediately remove the targeted note from IndexedDB and from the displayed note list without requiring a page refresh. The note must not reappear after a page refresh. Any counts or badges reflecting trashed note counts must update immediately after deletion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "In the Trash view, 'Delete permanently' must actually remove the note from storage and from the UI instantly.",
          "The deleted note must not reappear after refresh.",
          "Counts/badges (if any) should update immediately."
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Delete permanently' on a trashed note removes it from the UI list instantly.",
        "The permanently deleted note is removed from IndexedDB and does not reappear on page refresh.",
        "Any count or badge for trashed notes decrements immediately after permanent deletion.",
        "The 'Restore' action for other trashed notes continues to work correctly.",
        "No new UI elements are introduced."
      ]
    },
    {
      "id": "REQ-3",
      "text": "If 'Empty Trash' exists in the Trash view, it must permanently delete all trashed notes from IndexedDB and clear them from the UI instantly. After the operation, no trashed notes should appear on refresh and any trash count badges must reset to zero immediately.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Also ensure 'Empty Trash' (if present) permanently deletes all trashed notes and updates the UI instantly."
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Empty Trash' removes all trashed notes from the UI list instantly.",
        "All trashed notes are deleted from IndexedDB and do not reappear on page refresh.",
        "Any trash count badges reset to zero immediately after Empty Trash.",
        "No new UI elements are introduced."
      ]
    }
  ],
  "constraints": [
    "Do NOT change any UI layout, visual design, styling, or color.",
    "Do NOT rename any components, functions, hooks, or files.",
    "Do NOT add any new UI elements.",
    "Do NOT change any feature behavior beyond the two bugs described.",
    "Storage method must remain IndexedDB as already used by the app.",
    "The 'Restore' action in Trash must continue to work as-is."
  ],
  "nonGoals": [
    "Any UI or layout changes.",
    "Any new features or pages.",
    "Changes to backend Motoko code.",
    "Changes to any other section of the app (Routines, Records, Streak, Quotes, Settings, Home).",
    "Changing the storage mechanism from IndexedDB."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}