{
  "kind": "coverage_report",
  "version": "1.0",
  "generatedAt": "2026-02-28T01:03:01.291Z",
  "sources": {
    "buildRequest": true,
    "implementationPlan": true
  },
  "requirements": {
    "total": 5,
    "implemented": 4,
    "items": [
      {
        "id": "REQ-1",
        "summary": "Create a recordExport utility (frontend/src/utils/recordExport.ts) that exports records as TXT, DOC (Word-compatible HTML), and JSON files. Each record must include its title/main text, body/details, date+time formatted using the existing dateFormatter utility (AM/PM, matching current app format), and any existing fields/tags. File naming must follow the pattern records_YYYY-MM-DD_HHMM.(txt/doc/json). Export must be entirely client-side and work offline — no backend calls. Do not remove or alter any existing export behavior in useRecords.ts or RecordsPage.tsx.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/utils/recordExport.ts"
        ],
        "matchedFiles": [
          "frontend/src/utils/recordExport.ts"
        ]
      },
      {
        "id": "REQ-2",
        "summary": "In RecordsPage.tsx, add TXT and WORD (DOC) export format options to the existing Records Import/Export area, alongside the existing JSON export. The new format buttons must be minimal UI additions that visually match the current design — do not change any layout, styling, or other UI elements. All three formats should be available (TXT, DOC, JSON).",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/pages/RecordsPage.tsx"
        ],
        "matchedFiles": [
          "frontend/src/pages/RecordsPage.tsx"
        ]
      },
      {
        "id": "REQ-3",
        "summary": "Add a microphone/speech-to-text button exclusively inside the Record Add/Edit modal/flow in the Records section. Use the browser Web Speech API (SpeechRecognition / webkitSpeechRecognition) via the existing useSpeechRecognition hook (frontend/src/hooks/useSpeechRecognition.ts). The button must support start/stop, display live/interim transcription, and append or insert transcribed text into the active record input field. Do not store audio — only the resulting text. If speech recognition is not supported by the browser, display a small inline message: 'Speech-to-text not supported on this browser.' Manual typing and saving must remain fully functional. Do not modify any other part of the Records UI or any other section of the app.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/pages/RecordsPage.tsx"
        ],
        "matchedFiles": [
          "frontend/src/pages/RecordsPage.tsx"
        ]
      },
      {
        "id": "REQ-4",
        "summary": "Update the Record data schema (frontend/src/db/schema.ts) to add an optional imageId (or imageData) field to the Record interface to support storing a reference to a compressed image. Also update the backend main.mo actor if the record structure is persisted there; otherwise this is frontend-only since records are stored in IndexedDB.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/db/schema.ts"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-5",
        "summary": "Add an 'Add Image' button exclusively inside the Record Add/Edit modal/flow. When clicked, it opens a device file picker for image selection. After selection, compress the image client-side using the existing imageCompression utility (frontend/src/utils/imageCompression.ts) to a maximum width of 1600px at JPEG/WebP quality ~0.7. Store the compressed image in IndexedDB using the existing useImageStorage hook (frontend/src/hooks/useImageStorage.ts), linking it to the record via the new imageId field. Display the attached image as a thumbnail in the record view. While editing, allow removing or replacing the image. Do not change any other record layout beyond showing the image thumbnail in the appropriate place. Do not modify any other section of the app.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/pages/RecordsPage.tsx"
        ],
        "matchedFiles": [
          "frontend/src/pages/RecordsPage.tsx"
        ]
      }
    ]
  },
  "changedFiles": [
    "build-request.json",
    "feature_evidence.json",
    "frontend-file-summaries.txt",
    "frontend-implementation-plan.json",
    "frontend/src/App.tsx",
    "frontend/src/pages/RecordsPage.tsx",
    "frontend/src/utils/recordExport.ts",
    "project_state.json",
    "scratch/component-selection.json",
    "spec.md",
    "spec_vs_diff_report.json"
  ]
}