{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add image upload and camera capture to Routine section",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add image attachment feature to routine items with gallery upload and camera capture options, storing images in IndexedDB and displaying thumbnails on routine cards",
      "acceptanceCriteria": [
        "Routine item add/edit modal or inline UI shows two distinct buttons/options: one for gallery upload and one for camera capture.",
        "Gallery upload uses an <input type=\"file\" accept=\"image/*\"> element.",
        "Camera capture uses an <input type=\"file\" accept=\"image/*\" capture=\"environment\"> element.",
        "Selected image is compressed (using existing compressImage utility) and saved to IndexedDB via useImageStorage.",
        "A thumbnail preview of the attached image is visible on the routine item card after saving.",
        "The attached image can be removed/replaced.",
        "All existing routine features (drag-to-reorder, time/icon fields, speech recognition, import/export, weekday/weekend/today tabs, complete toggle) remain fully functional and unchanged.",
        "No backend changes are made."
      ],
      "file_operations": [
        {
          "path": "frontend/src/db/schema.ts",
          "operation": "modify",
          "description": "Add an optional imageId field (string or undefined) to the RoutineItem interface to store the IndexedDB imageBlobs reference for attached images. Do not modify any other fields in RoutineItem or RoutineProfile."
        },
        {
          "path": "frontend/src/pages/RoutinesPage.tsx",
          "operation": "modify",
          "description": "Add image upload UI to the routine item add/edit modal or inline form. Include two distinct input options: (1) a button/input for gallery upload using <input type=\"file\" accept=\"image/*\"> and (2) a button/input for camera capture using <input type=\"file\" accept=\"image/*\" capture=\"environment\">. When an image is selected, compress it using the existing compressImage utility from imageCompression.ts, save it via useImageStorage hook, and store the returned imageId in the routine item. Display a thumbnail preview of the attached image in the modal/form. Add a remove/replace button for the image. On routine item cards, display a thumbnail preview if imageId is present by retrieving the image URL via useImageStorage. Ensure all existing functionality (drag-to-reorder, time/icon fields, speech recognition, import/export, tab switching, complete toggle) remains unchanged. Use the existing useImageStorage hook for all image storage operations. Verify the useImageStorage hook's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useRoutines.ts",
          "operation": "modify",
          "description": "Update the addRoutine and updateRoutine functions to handle the new optional imageId field in RoutineItem when saving to IndexedDB. When deleting a routine item, check if it has an imageId and call deleteImage from useImageStorage to clean up the orphaned image blob. Do not modify any other routine management logic, including reorder, toggle-complete, or profile switching functionality."
        },
        {
          "path": "frontend/src/utils/routineExport.ts",
          "operation": "modify",
          "description": "Update the export functions (TXT, DOC, JSON) to include the imageId field when exporting routine items. For JSON export, include imageId as-is. For TXT and DOC exports, optionally mention if an image is attached (e.g., '[Image attached]') without embedding the actual image data."
        },
        {
          "path": "frontend/src/utils/routineImport.ts",
          "operation": "modify",
          "description": "Update the import parsers (JSON, TXT, DOC) to handle the optional imageId field when importing routine items. For JSON imports, preserve the imageId if present (note: the actual image blob must already exist in IndexedDB for the reference to be valid). For TXT and DOC imports, imageId will typically be undefined since image data is not embedded in those formats."
        }
      ]
    }
  ]
}