{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make note labels/tags configurable (add, rename, delete with persistence)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update the useLabels hook to expose createLabel, updateLabel (except for 'All'), and deleteLabel (except for 'All') operations with safe note reassignment",
      "acceptanceCriteria": [
        "createLabel adds a new label to IndexedDB and updates the UI label list",
        "updateLabel renames an existing label in IndexedDB; calling it on 'All' is a no-op or blocked",
        "deleteLabel removes a label from IndexedDB; calling it on 'All' is a no-op or blocked",
        "After deleteLabel, all notes previously assigned that label are updated so their label field is set to 'All' (or equivalent safe default)",
        "No note data is lost or corrupted when a label is deleted"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLabels.ts",
          "operation": "modify",
          "description": "Add guard logic to prevent updateLabel and deleteLabel operations on the 'All' label. Enhance the deleteLabel function to query all notes using that label and batch-update their labelId field to 'All' before removing the label from the labels table. Add toast notifications for blocked operations. Ensure createLabel validates label names and handles duplicates gracefully."
        },
        {
          "path": "frontend/src/hooks/useNotes.ts",
          "operation": "modify",
          "description": "Add a bulkUpdateLabelReassignment utility function that accepts an old labelId and new labelId, then updates all matching notes in IndexedDB. This function will be called by useLabels when a label is deleted to ensure notes are safely reassigned to 'All' without data loss."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Expose label management UI through the existing LabelManager modal component so users can add, rename, and delete labels (except 'All')",
      "acceptanceCriteria": [
        "The LabelManager modal allows adding a new label by entering a name and confirming",
        "The LabelManager modal allows renaming any label except 'All' inline",
        "The LabelManager modal allows deleting any label except 'All', with a confirmation step",
        "'All' label has no rename or delete controls visible",
        "No changes are made to the Notes page layout, label filter bar, note cards, or any other UI outside the LabelManager modal"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/notes/LabelManager.tsx",
          "operation": "modify",
          "description": "Wire the existing createLabel, updateLabel, and deleteLabel functions from useLabels into the modal UI. Add conditional rendering to hide rename and delete controls for the 'All' label row. Implement inline editing for label names with validation. Add a confirmation dialog (using the existing Modal component) before executing deleteLabel. Ensure the modal only modifies label management UI and does not affect any other Notes page layout or components."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure the label filter bar in NotesPage continues to read labels dynamically from the persisted labels list so changes are immediately reflected",
      "acceptanceCriteria": [
        "After adding a new label, it appears in the filter bar on the Notes page",
        "After renaming a label, the updated name appears in the filter bar",
        "After deleting a label, it is removed from the filter bar",
        "Selecting any label in the filter bar correctly filters notes to those assigned that label, same as current behavior",
        "'All' always appears as the first filter option"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/NotesPage.tsx",
          "operation": "modify",
          "description": "Verify that the label filter bar reads labels from the useLabels hook reactively. Ensure labels are sorted with 'All' first, followed by other labels. Confirm that label changes trigger re-renders of the filter bar without requiring a page reload. No layout or styling changes are needed; only verify reactive data binding."
        }
      ]
    }
  ]
}