{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix: Labels instant update and Trash permanent delete",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "When a label is added or renamed via LabelManager, the Notes filter bar must update immediately without page refresh, keeping selected label active if renamed",
      "acceptanceCriteria": [
        "Adding a label via LabelManager causes it to appear in the Notes filter bar without any page refresh.",
        "Renaming a label via LabelManager updates the label name in the Notes filter bar without any page refresh.",
        "If the active filter label was renamed, it remains selected and shows the new name immediately.",
        "The updated labels are persisted in IndexedDB (same storage method already used) and survive a page refresh.",
        "UI state and IndexedDB state are always in sync after add or rename."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLabels.ts",
          "operation": "modify",
          "description": "Modify addLabel and renameLabel functions to return the operation result synchronously and ensure IndexedDB updates complete before returning. Verify that these functions properly handle duplicate/reserved name guards and complete all database writes atomically."
        },
        {
          "path": "frontend/src/components/notes/LabelManager.tsx",
          "operation": "modify",
          "description": "Update the component to call a parent-provided refresh callback after successful add or rename operations in useLabels. Pass the updated label data (including new ID for added labels and updated name for renamed labels) back to the parent NotesPage component to trigger immediate UI refresh."
        },
        {
          "path": "frontend/src/pages/NotesPage.tsx",
          "operation": "modify",
          "description": "Add a labels refresh mechanism that reloads the labels list from IndexedDB immediately after LabelManager completes an add or rename operation. When a label is renamed and it matches the currently active filter, update the active filter state to use the new label name while keeping the same label ID selected. Ensure the filter bar re-renders with the updated label list without requiring page reload."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "In Trash view, 'Delete permanently' must immediately remove the note from IndexedDB and UI without page refresh, updating counts instantly",
      "acceptanceCriteria": [
        "Clicking 'Delete permanently' on a trashed note removes it from the UI list instantly.",
        "The permanently deleted note is removed from IndexedDB and does not reappear on page refresh.",
        "Any count or badge for trashed notes decrements immediately after permanent deletion.",
        "The 'Restore' action for other trashed notes continues to work correctly.",
        "No new UI elements are introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useNotes.ts",
          "operation": "modify",
          "description": "Add or modify the permanent delete capability to fully remove a note from the IndexedDB notes table (not just mark it as deleted). Ensure this function removes the note record completely and triggers an immediate state update to refresh the notes list in memory."
        },
        {
          "path": "frontend/src/pages/NotesPage.tsx",
          "operation": "modify",
          "description": "Wire the permanent delete action in the Trash view to call the permanent delete function from useNotes and immediately refresh the displayed notes list and trash count. Ensure the UI updates synchronously after the IndexedDB delete completes, removing the note from the rendered list without page refresh."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "If 'Empty Trash' exists, it must permanently delete all trashed notes from IndexedDB and clear UI instantly, resetting trash count to zero",
      "acceptanceCriteria": [
        "Clicking 'Empty Trash' removes all trashed notes from the UI list instantly.",
        "All trashed notes are deleted from IndexedDB and do not reappear on page refresh.",
        "Any trash count badges reset to zero immediately after Empty Trash.",
        "No new UI elements are introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useNotes.ts",
          "operation": "modify",
          "description": "Add or modify an emptyTrash function that queries all notes with isTrashed=true and permanently deletes them from the IndexedDB notes table in a batch operation. Ensure the function triggers an immediate state update after all deletions complete."
        },
        {
          "path": "frontend/src/pages/NotesPage.tsx",
          "operation": "modify",
          "description": "If an 'Empty Trash' button or action exists in the Trash view, wire it to call the emptyTrash function from useNotes and immediately refresh the notes list and trash count to reflect zero trashed notes. Ensure the UI clears all trashed notes from display and resets the count badge synchronously after the batch delete completes."
        }
      ]
    }
  ]
}