{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Routines Export Formats (TXT/WORD/JSON) and Mic Speech-to-Text in Routine Add/Edit",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add TXT, WORD (DOC), and JSON export format options to the existing Routines export area in RoutinesPage.tsx, preserving all existing export behavior",
      "acceptanceCriteria": [
        "TXT, WORD (DOC), and JSON export options are visible in the existing Routines export area.",
        "Existing export behavior is unchanged; new formats are additive only.",
        "The UI addition is minimal and matches the current design style."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RoutinesPage.tsx",
          "operation": "modify",
          "description": "Add three new export format options (TXT, WORD/DOC, JSON) to the existing Routines export UI area. Use a minimal UI addition such as a format selector dropdown or additional buttons that match the existing design style. Wire the new export options to call the corresponding export functions from frontend/src/utils/routineExport.ts. Do not remove or alter any existing export functionality."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement client-side export logic for routines in TXT, WORD (DOC as Word-compatible HTML), and JSON formats with complete profile and item data, using timestamped filenames",
      "acceptanceCriteria": [
        "Exported TXT file contains profile, AM/PM time, title, and any other stored fields for each item.",
        "Exported DOC file (Word-compatible HTML) contains the same fields and opens in Word.",
        "Exported JSON file contains the same fields in structured JSON.",
        "Downloaded file is named routines_YYYY-MM-DD_HHMM with the appropriate extension.",
        "Export works fully offline without any network requests."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/routineExport.ts",
          "operation": "modify",
          "description": "Extend or update the existing export functions to support TXT, WORD (DOC as Word-compatible HTML), and JSON formats. Each export must include for every routine item: Profile (Weekdays/Weekends/Auto), time in AM/PM format, title, and all other stored fields (description, tag, duration, etc.). Generate filenames using the pattern routines_YYYY-MM-DD_HHMM.(txt|doc|json) with the current local date and time. Ensure all export logic is entirely client-side using only browser APIs (no server calls) and works offline."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a Mic button for speech-to-text using the Web Speech API inside the Routine Add/Edit form, showing live transcription and inserting the final text into the active input field",
      "acceptanceCriteria": [
        "A Mic button appears only inside the Routine Add/Edit form, next to the title or notes input.",
        "Clicking the Mic button starts speech recognition; live interim results are shown.",
        "Clicking Stop (or the Mic button again) ends recognition and appends the final transcript to the input field.",
        "Manual typing continues to work normally before, during, and after recognition.",
        "The save/submit flow is unaffected.",
        "No audio data is stored; only the text transcript is inserted into the field."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RoutinesPage.tsx",
          "operation": "modify",
          "description": "Add a small Mic button next to the routine title or notes input field inside the Routine Add/Edit modal or form. When clicked, use the existing useSpeechRecognition hook (frontend/src/hooks/useSpeechRecognition.ts) to start speech recognition, display live interim transcription inline, and append/insert the final transcribed text into the active input field. A second click (or a Stop button) ends recognition. Ensure this addition does not interfere with manual typing or the save/submit flow. Do not store audio; only insert the resulting text string into the input field. Verify the useSpeechRecognition hook's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useSpeechRecognition.ts",
          "operation": "modify",
          "description": "Review and extend the existing useSpeechRecognition hook if necessary to ensure it supports start/stop controls, exposes live interim transcription state, and provides the final transcript result. Ensure the hook uses the browser Web Speech API (SpeechRecognition or webkitSpeechRecognition) and handles errors gracefully."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Display a fallback message 'Speech-to-text not supported on this browser.' inside the Routine Add/Edit form when SpeechRecognition is unavailable, hiding the Mic button",
      "acceptanceCriteria": [
        "On browsers without SpeechRecognition support, the Mic button is not rendered.",
        "Instead, the message 'Speech-to-text not supported on this browser.' is shown inline in the Routine Add/Edit form.",
        "The rest of the form functions normally on unsupported browsers."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RoutinesPage.tsx",
          "operation": "modify",
          "description": "Add a browser capability check for SpeechRecognition (window.SpeechRecognition or window.webkitSpeechRecognition) inside the Routine Add/Edit form. If the API is not supported, hide the Mic button and display a small inline message reading 'Speech-to-text not supported on this browser.' in its place. Ensure the rest of the form functions normally on unsupported browsers."
        }
      ]
    }
  ]
}